[
  {
    "sex": "Male",
    "other_statuses": "Deceased",
    "status": "Alive",
    "alias(es)": "DadHomer Thompson[1] Homer Samson[2]Brian McGeeKrusty the ClownCommander CoolSir Fix-A-LotPie ManMax Power[3]El HomoThad SuperspermBald Mommy[4]Rock Strongo[5]Lance Uppercut[5]Colonel Homer[6]Elvis Jagger Abdul - Jabbar [7]Dancin' Homer[8]Angry DadCaptain WackyGeraldo Simpson[9]Admiral AwesomeMr. BurnsMrs. Burns[10]Chad SexingtonCaptain CrazyLance RomanceMr. PlowAutomobile Von BismarckThe Immovable Object[11]The Brick Hithouse[11]The Southern Dandy[11]King-Size HomerHome BoyHome DudeInternet KingDr. TunaTyranosaurus sexHappy DudeHomie (by Marge)Mr. X (anonymously)Homer Finger Hands [12]Fish Bulb [13]Springfield (by Shelby's Father)Peter Pantless",
    "hair": "BaldBrown (formerly)",
    "occupation": "Currently: Nuclear Safety InspectorNuclear Technician (formerly)Other Jobs: (see List of Homer's jobs)",
    "location": "Springfield, Springfield's State",
    "relatives": "Parents: Abraham Simpson and Mona SimpsonWife: Marge BouvierEx-Wife: Amber SimpsonStepmother: Rita LaFleurChildren: Bart Simpson, Lisa Simpson and Maggie SimpsonUncles: Hubert Simpson, Tyrone Simpson, Chet Simpson, Cyrus Simpson, Bill SimpsonAunt: Hortense SimpsonMarital Aunts: Cyrus' 15 wives  Kari Olsen Cousins: Frank Simpson, Valerie Rothman, Omar Simpson, and Dr. SimpsonHalf-Brother: Herbert PowellHalf-Sister: Abbie SimpsonThird Cousin Once Removed: Simon SimpsonGrandfathers: Orville Simpson and Bjorn OlsenGrandmothers: Yuma Hickman and Linnea PenelopeSisters-in-Law: Patty Bouvier and Selma BouvierFather-in-Law: Clancy BouvierMother-in-Law: Jacqueline GurneyCousin-in-law: Marnie SimpsonNephew: Brit SimpsonNieces: Lily and Magpie SimpsonAdoptive Marital Niece: Ling BouvierSee Simpson family",
    "first_appearance": "\"Good Night\"",
    "voiced_by": "Dan CastellanetaDon Jordan (singing voice; \"Homer's Barbershop Quartet\")Harry Shearer (nose whistling; \"Homer Loves Flanders\")John Ratzenberger (\"Treehouse of Horror XXV\")",
    "name": "Homer Simpson"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "alias(es)": "MomMrs. Simpson[1]Midge[2]Major MargeMarge Bouvier",
    "hair": "Blue, naturally grey",
    "occupation": "Housewife",
    "location": "742 Evergreen Terrace, Springfield, Springfield's State",
    "relatives": "Parents: Clancy Bouvier and Jacqueline BouvierSisters: Patty and Selma BouvierHusband: Homer SimpsonChildren: Bart Simpson, Lisa Simpson and Maggie SimpsonFather-in-Law: Abraham SimpsonMother-in-Law: Mona SimpsonHalf-Brother-in-Law: Herbert PowellHalf-Sister-in-Law: Abbie SimpsonCousin-in-Law: Omar SimpsonNephew: Brit SimpsonNieces: Lily and Magpie SimpsonAdoptive Niece: Ling BouvierGrandfathers: Pépé Bouvier and Ferdinand GurneyGrandmothers: Bambi Bouvier and Alvarine BisqueEx-Brothers-in-Law: Sideshow Bob, Lionel Hutz, Troy McClure, Disco Stu and Fit TonyUncles: Chester Bouvier, Arthur Bouvier, Herman Bouvier, JoJo Bouvier and Lou GurneyAunts: Charlene Bouvier and Gladys GurneyMarital Aunt: Alfreda LeDouxCousins: Pierre Bouvier, Alfreda Bouvier II, Dorothé Bouvier, Rowena Bouvier, Tootsie Bouvier, Marnie Simpson, and Dot Gurney Great Grandfather Great Grandpa Bouvier",
    "first_appearance": "\"Good Night\"",
    "voiced_by": "Julie Kavner",
    "name": "Marge Simpson"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "BartmanEl BartoCupcake KidThe \"I Didn't Do It\" BoyEdith KnickertwistBartronBaby Stink Breath[1]Cosmos[2]RustyBart-Dude (by Otto Mann)Bart BartTimmy O' TooleThe Thing From UranusBeautiful BartLaddie LibertyCal A. BungaEarring BoySpecial Little Guy (By Marge)The Great Bart-oNaked Fairy Godboy [3]Bart FlandersDr. Ima ButtfaceThe Boy (by Homer)Ratboy (by Homer)Shoes Butt-back[4]",
    "hair": "Blonde",
    "occupation": "Student at Springfield Elementary School",
    "location": "Springfield",
    "relatives": "Father: Homer SimpsonMother: Marge SimpsonTwin Brother: Hugo Simpson II (non-canon)Sisters: Lisa Simpson and Maggie SimpsonGrandfathers: Abraham Simpson and Clancy Bouvier Grandmothers: Mona Simpson and Jacqueline BouvierUncle: Omar SimpsonAunts: Marnie Simpson, Patty Bouvier, and Selma BouvierCousins: Brit, Lily, and Magpie SimpsonHalf-Uncle: Herbert PowellHalf-Aunt: AbbieAdoptive Cousin: Ling Bouvier",
    "first_appearance": "\"Good Night\"",
    "voiced_by": "Nancy CartwrightSteve Allen (Electronically altered voice)Daniel Stern (Adult Bart, narrator \"Three Men and a Comic Book\")",
    "name": "Bart Simpson"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "alias(es)": "Jake Boyman[1]Truth TellerLie SmellerLady Penelope Ariel Ponyweather[2] Lisa Bouvier (briefly)Raven Crow NeversmilesBig Maggie[3] [4] [5] Princess HelveticaSister Suspect [6]Lisa Flanders Moaning LisaMary-Anne [7]",
    "hair": "Blonde",
    "occupation": "Student at Springfield Elementary School, CTU Agent, Hall-monitorFormer: Babysitter Founder of SpringFace Kids News anchor",
    "relatives": "Father: Homer SimpsonMother: Marge SimpsonBrother: Bart SimpsonSister: Maggie SimpsonHalf-Uncle: Herbert PowellUncle: Omar SimpsonAunts: Patty, Selma Bouvier, and Marnie SimpsonHalf-Aunt: AbbieCousins: Brit, Lily, and Magpie SimpsonAdoptive Cousin: Ling BouvierGrandfathers: Abraham Simpson and Clancy BouvierGrandmothers: Mona Simpson and Jacqueline Bouvier",
    "first_appearance": "\"Good Night\"",
    "voiced_by": "Yeardley Smith",
    "name": "Lisa Simpson"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "alias(es)": "The BabyBaby BartI'm a Stupid Baby (Bart's note in \"Home Sweet Homediddly-Dum-Doodily\" originally placed on Lisa's back)Lisa (in the Tracey Ullman Short when Homer confuses Lisa and Maggie due to their hair genes)Outlands Maggie [1]",
    "hair": "Blonde",
    "relatives": "Father: Homer SimpsonMother:  Marge SimpsonBrother: Bart SimpsonSister: Lisa Simpson Half-Uncle: Herbert PowellHalf-Aunt: AbbieUncle: Omar SimpsonAunts: Marnie Simpson, Patty Bouvier, and Selma BouvierCousins: Brit Simpson, Lily Simpson, and Magpie SimpsonAdoptive Cousin: Ling BouvierGrandfathers: Abraham Simpson and Clancy BouvierGrandmothers: Mona Simpson and Jacqueline BouvierMother Kang (Non Conon)",
    "first_appearance": "\"Good Night\"",
    "voiced_by": "Nancy Cartwright (Currently)Yeardley Smith (Formerly)Danny DeVito (\"Brother, Can You Spare Two Dimes?\")Elizabeth Taylor (\"Lisa's First Word\")Jodie Foster (\"Four Great Women and a Manicure\")Harry Shearer (\"Treehouse of Horror IX\"; \"Treehouse of Horror X\")James Earl Jones (\"Treehouse of Horror V\")Kevin Michael Richardson (\"Treehouse of Horror XXVIII\")Matt Groening (pacifier)Liz Georges (The Tracey Ullman Show)Gábor Csupó (pacifier; formerly)",
    "name": "Maggie Simpson"
  },
  {
    "sex": "Male",
    "other_statuses": "...",
    "status": "Alive",
    "alias(es)": "AbeGrampa SimpsonGrampaLove TesterGorgeous GodfreyLil' Grampa SimpsonYoung Grampa Simpson Abraham Jay SimpsonAbe Simpson llAbe SimpsonAbraham Simpson",
    "hair": "Blondish, formerly brown and grey",
    "occupation": "RetiredPresident of the Springfield Gay & Lesbian AllianceSpringfield Communist Party memberWorld War II VeteranFlying Hellfish memberOwner of Simpson Laser Tag (formerly)Night Watchman at Cranberry Silo (formerly)",
    "location": "Springfield Retirement Castle",
    "relatives": "Father: Orville SimpsonMother: Yuma HickmanBrothers: Bill Simpson, Cyrus Simpson , Chet Simpson, Tyrone Simpson, Hubert Simpson, Fester SimpsonPossible sister/Possible aunt: Hortense SimpsonWives: Mona Simpson (deceased), Amber Simpson (deceased), Rita LaFleurEx-wives:  Selma Bouvier, Tallulah WinkelmanFather-in-law: Bjorn Olsen Mother-in-law: Linnea PenelopeEx-father-in-law: Clancy BouvierEx-mother-in-law: Jacqueline BouvierSons: Homer Simpson, Herbert PowellEx-adopted-step-daughter: Ling BouvierDaughter: Abbie SimpsonDaughter-in-law: Marge BouvierEx-daughter-in-law: Amber Simpson (deceased)Grandson: Bart SimpsonGranddaughters: Lisa SimpsonMaggie SimpsonSisters-in-law: Cyrus's 15 wivesPaternal grandfather: \"Old Tut\" SimpsonPaternal grandmother: \"Happy\" DinsdaleMaternal grandfather: Willard HickmanMaternal grandmother: Theodora HutshingGreat-grandfathers: Abraham Simpson IHoratio DinsdaleBertram HickmanGreat-grandmothers: Gabby CrouseEdwina ForayterNellie BalliwickGreat-great-grandparents: Virgil SimpsonMabel SimpsonAunts: Twitta SimpsonElrita SimpsonBonita SimpsonUncles: Boris SimpsonZeke HickmanGreat-uncles: Lou SimpsonHugo Simpson IUdell \"Spunky\" DinsdaleGreat-half-uncle: Gaston SimpsonGreat-half-aunt: Dulcine SimpsonGreat-grandaunt: Eliza SimpsonMarital great-granduncle: Milford Van HoutenNephews: Millionaire Actor, Omar Simpson, and Frank SimpsonNiece: Valerie RothmanNephew-in-law: Dave RothmanNiece-in-law: Marnie SimpsonGrandnephew: Brit SimpsonGrandnieces: Lily and Magpie SimpsonGreat-nephew: Stanley Simpson1st cousins once removed: Echardt SimpsonBob SimpsonTwyla SimpsonSecond cousins: Verna SimpsonVern SimpsonEchardt Simpson IILotus SimpsonFernice SchedeenIngrid SchedeenGreat Great Grandson: Moe Simpson",
    "first_appearance": "\"World War III\" (Photograph only) \"Grandpa & the Kids\" (First speaking appearance)",
    "voiced_by": "Dan Castellaneta",
    "name": "Abraham Simpson II"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "Stupid FlandersDevil FlandersStupid Sexy Flanders",
    "hair": "Brown",
    "occupation": "Pharmacist (previously to the show)Owner at The Leftorium (now closed)742 Evergreen Terrace (Ex-owner)Storytown Village (former)Praiseland (former)4th Grade teacher at Springfield Elementary School (temporary)",
    "relatives": "Parents: Nedsel and Agnes Flanders Sister: Nediana Flanders  Wives: Edna (deceased)Maude (deceased) andGinger FlandersEx-girlfriends: Sara Sloane and Rachel JordanSons: Rod and Todd FlandersCousins: José Flanders, Lord Thistlewick Flanders, Ted Flanders and Nedna FlandersGrandmother: Grandma Flanders",
    "first_appearance": "\"Simpsons Roasting on an Open Fire\"",
    "voiced_by": "Harry ShearerKarl Wiedergott (\"Homer to the Max\")Frank Welker (\"Treehouse of Horror X\")Tress MacNeille (screaming)",
    "name": "Ned Flanders"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "Fruit Bat ManHappy (one episode)Future BurnsOld Man BurnsMr. Burns (most common)Mean Man MontyBongo-head (one episode)Sir (mostly by Smithers)Burnsie (mainly by Lenny)M. Burns Monty  C.M. Burns  C. Montgomery Burns",
    "hair": "Gray, balding",
    "occupation": "SS officer (formerly)Owner of the Springfield Nuclear Power PlantPresident of the Springfield MonorailOwner of the Springfield Estadio de TorosWorld War II Veteran",
    "relatives": "Parental Grandfather/Adoptive father: Wainwright Montgomery BurnsPaternal grandmother: Evelyn GraycombMaternal Grandfather: Jean-Claude CharlesMaternal Grandmother: Ophelia CharlesFather: Clifford Burns Mother: Daphne CharlesSiblings: 11, including George Burns, Cornelius Burns, Cornelia Hernandez and Zeph BurnsGirlfriend: Maxine LombardSons: Larry BurnsWaylon Smithers, Jr. (foster son)Nieces: Pepita HernandezVictoria Burns-Vanderbilt-DuPont-Bush-RockeFeller-Symthe-Pitt-WhitneyAunt: Doreena BurnsCousins: Lyla and Mr. BumbleGrandchildren: UnnamedGreat-Grandfather: Franklin Jefferson Burns[1]Daughter-in-law: UnnamedFourth cousin: Abraham Simpson",
    "first_appearance": "\"Simpsons Roasting on an Open Fire\"",
    "voiced_by": "Christopher Collins (Early Season 1)Harry Shearer (Season 1-present)Nancy Cartwright (Angry Dad)M. Samejima (The Simpsons Arcade Game)",
    "name": "Charles Montgomery Burns"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "Krusty the ClownKrustyRory B. BellowsThe Prince of Pies[1] Krusty The Klown[2] Soggy The Clown",
    "hair": "Green",
    "occupation": "Television personalityEntertainerCongressman",
    "location": "Springfield, Springfield's State",
    "relatives": "Father: Rabbi Hyman Krustofsky (deceased)Mother: Rachel Krustofsky[3]  (deceased)Grandfather: Rabbi Zev Krustofsky (deceased)Children: Sophie Krustofsky, Chin Ho, Chan Ho, many unnamed, many illegitimate sons and UnnamedHalf-brother: Luke PerryHalf-Sister:  Gina  Sister: Barbara Van HorneEx-brother-in-law: Melvin Van HorneNephews: Josh and Melvin Van Horne's sonEx-wifes: 14, including Holly Hippie, and Mia FarrowEx-fiancée: Princess PenelopeCousin: Krumpet the Klown",
    "first_appearance": "\"The Krusty the Clown Show\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Krusty the Clown"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "Morris SzyslakMoammar SzyslakUncle MoeMr. MoeKid MoeKid GorgeousKid PresentableKid GruesomeMooUgly Hate Filled Man",
    "hair": "GrayBlack (formerly/younger self)",
    "occupation": "Bartender of Moe's TavernUnlicensed SurgeonVolunteer FirefighterEmperor of Springfield(formerly)Former TV actor",
    "relatives": "Mother: Mary Szyslak Father: Morty SzyslakBrothers: Stringfellow SzyslakGandamac SzyslakMarv SzyslakSisters: Portia SzyslakMinnie SzyslakEx-girlfriends: Renee, Betty, Edna Krabappel, Selma Bouvier and MayaPossible Relatives: Little Moe Szyslak and JoeGirlfriend: Laney FontaineGrandmother: Moe's Grandmother",
    "first_appearance": "\"Simpsons Roasting on an Open Fire\"",
    "voiced_by": "Hank Azaria",
    "name": "Moe Szyslak"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "Armin Tamzarian (non-canon)Mutant Skinner (non-canon) [1]Wizard Skinner (non-canon) [2]Big Butt SkinnerThe PenalizerTwo Basket SkinnerPrincipal Skinner Sergeant Skinner Fireman Skinner [3]Dick FiddlerSpankyThe SticklerPrinskipper SkippalPrinnipple SkimpsterPrincipal Stinkface",
    "hair": "GrayBrown (originally)",
    "occupation": "Principal of Springfield Elementary SchoolCo-Owner of Chalmskinn ProductionsSinger (formerly)  Street Punk (formerly) Soldier in Vietnam War (formerly)Fourth grade science teacher (\"Bart the Murderer\")Fireman",
    "relatives": "Mother: Agnes SkinnerFather: Sheldon SkinnerUncle: StevieEx-Girlfriends: Edna Krabappel, Patty Bouvier, Calliope JuniperCousin: Headmaster Skinnedwiener",
    "first_appearance": "\"Simpsons Roasting on an Open Fire\"",
    "voiced_by": "Harry ShearerJames Campbell (singing voice)[4]",
    "name": "Seymour Skinner"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "Lou La Trec[1]Eagle Eye[2]Maestro[3]CJ[4]ThrillhouseThe HouseMilhouse Van Damme HoutenMilpool[5]Van Houten[6]Winnie[7]Fallout Boy [8]Kirk Van Houten[9]",
    "hair": "Black, dyed blue",
    "occupation": "Student at Springfield ElementarySinger at Party PosseReader at Kidz NewzRadioactive Man's assistant",
    "location": "Springfield",
    "relatives": "Parents: Luann Van Houten and Kirk Van HoutenParental Uncle: Norbert Van HoutenMaternal Half-Uncle: Bastardo MussoliniMaternal Aunt: Mrs. MussoliniParental Cousins: Annika and Milquetoast Van HoutenMaternal Grandparents: Nana Sophie and Southern Cracker ManagerPaternal Grandparents: Grandpa Van Houten and Grandma Van HoutenStep-Grandmother: UnnamedGreat-great-great-great-great-grandparents: Milford Van Houten and Eliza Simpson",
    "first_appearance": "\"The Butterfinger Group\" (unofficial)Simpsons Roasting on an Open Fire (Official)",
    "voiced_by": "Pamela HaydenMichael Jackson (\"Do the Bartman\")Michael 'J' Horn (\"New Kids on the Blecch\")Hank Azaria (\"Hardly Kirk-ing\")",
    "name": "Milhouse Van Houten"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "alias(es)": "Mrs. Crabapple[1]Cigarette Mommy[2]Mrs.K[3]",
    "hair": "Brown",
    "occupation": "Owner of Edna's Edibles (formerly)Fourth grade teacher at Springfield Elementary School (formerly)",
    "relatives": "Husband: Ned FlandersEx-husband: Ken KrabappelEx-Fiancé: Seymour SkinnerStepsons: Rod and Todd FlandersSister: UnnamedEx-boyfriends: Moe SzyslakComic Book GuyCousin: Mrs. Plumtree",
    "first_appearance": "\"Bart the Genius\"",
    "voiced_by": "Marcia Wallace",
    "name": "Edna Krabappel"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "Steve BarnesSlime Q. SlimedogApu DeBeaumarchaisAchu[1]Apoo[2][3]",
    "hair": "Black",
    "occupation": "Owner of the Kwik-E-MartFormer: Medical StudentSinger",
    "relatives": "Father: Apu Nahasapeemapetilon Sr.Mother: Unnamed MotherWife: Manjula NahasapeemapetilonMistress (former): Annette TaylorEx-girlfriend: Selma BouvierChildren: The Nahasapeemapetilon OctupletsBrothers: Sanjay and Tikku Nahasapeemapetilon Nephew: JamshedNiece: Pahusacheta",
    "first_appearance": "\"The Telltale Head\"",
    "voiced_by": "Hank AzariaGeorge Economou (singing voice)[4]",
    "name": "Apu Nahasapeemapetilon"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "alias(es)": "Crazy Cat Lady",
    "hair": "Gray, formerly brown",
    "occupation": "Taking care of cats,  Doctor (formally),  Lawyer (formally)",
    "relatives": "Pets: Her own catsEx-Boyfriend: Crazy Dog Man",
    "first_appearance": "\"Girly Edition\"",
    "voiced_by": "Tress MacNeille",
    "name": "Eleanor Abernathy"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Black",
    "occupation": "Waiter at The Happy SumoKarate teacher at Springfield Martial Arts Academy",
    "first_appearance": "\"One Fish, Two Fish, Blowfish, Blue Fish\"",
    "voiced_by": "Hank AzariaGeorge Takei (One Fish, Two Fish, Blowfish, Blue Fish)",
    "name": "Akira"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "Sunday school teacher, owner of the Landromat",
    "first_appearance": "\"The Telltale Head\"",
    "voiced_by": "Maggie RoswellTress MacNeille",
    "name": "Ms. Albright"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Gray",
    "occupation": "ActorAuthorComedianDirectorMusicianPlaywrightScreenwriter",
    "relatives": "Wife: Soon-Yi Previn",
    "first_appearance": "\"The City of New York vs. Homer Simpson\"",
    "first_mentioned": "\"Treehouse of Horror III\"",
    "voiced_by": "Hank Azaria",
    "name": "Woody Allen"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Ginger",
    "occupation": "Tattoo artistJailbird",
    "first_appearance": "\"Marge in Chains\"",
    "voiced_by": "Pamela Hayden",
    "name": "Tattoo Annie"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "White",
    "occupation": "Owner of Shelbyville Nuclear Power Plant",
    "first_appearance": "\"Homer Defined\"",
    "voiced_by": "Jon LovitzDan Castellaneta",
    "name": "Aristotle Amadopolis"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "State Comptroller",
    "relatives": "None",
    "first_appearance": "\"Lisa Gets an \"A\"\"",
    "voiced_by": "Hank Azaria",
    "name": "State Comptroller Atkins"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Gray",
    "occupation": "Governor of Springfield's StateFormer Mayor of Springfield",
    "relatives": "Daughter: Missy Bailey[1]",
    "first_appearance": "\"Two Cars in Every Garage and Three Eyes on Every Fish\"",
    "voiced_by": "Maggie Roswell",
    "name": "Mary Bailey"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "White (beard), formerly dark brown",
    "occupation": "Retired",
    "relatives": "Wife: Estelle Beardly (deceased)[1]Granddaughter: UnnamedChildren: 2",
    "first_appearance": "Homer's Odyssey",
    "voiced_by": "Harry Shearer",
    "name": "Jasper Beardly"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Red",
    "occupation": "College Student",
    "first_appearance": "\"Homer Goes to College\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Benjamin (nerd)"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Blue, brown",
    "occupation": "Radio DJ",
    "first_appearance": "\"Bart Gets an \"F\"\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Bill (KBBL DJ)"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Light gingerBlueSandy blond",
    "occupation": "Actor",
    "first_appearance": "\"The Boy Who Knew Too Much\"",
    "voiced_by": "Phil HartmanTress MacNeille",
    "name": "Billy (actor)"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Gray",
    "occupation": "Talk Show Host",
    "first_appearance": "\"Sideshow Bob Roberts\"",
    "voiced_by": "Harry Shearer",
    "name": "Birch Barlow"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Black",
    "occupation": "Student",
    "first_appearance": "\"Bart the General\"",
    "voiced_by": "Pamela Hayden (currently)Jo Ann Harris (formerly)",
    "name": "Black Weasel"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "Burns' Lawyer[3]Luvum (possible)[4]Burnham (possible)[5]",
    "hair": "BlueGray[1]Black[2]",
    "occupation": "Lawyer",
    "first_appearance": "\"Bart Gets Hit by a Car\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Blue-Haired Lawyer"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Gray, naturally red",
    "occupation": "Springfield DMV Employee",
    "relatives": "Parents: Clancy Bouvier and Jacqueline GurneySisters: Selma Bouvier and Marge BouvierNephew: Bart SimpsonNieces: Lisa Simpson, Maggie Simpson and Ling Bouvier (adopted)Grandfathers: Pépé Bouvier and Ferdinand GurneyGrandmothers: Bambi Petitbois and Alvarine BisqueBrother-in-Law: Homer SimpsonEx-Brothers-in-Law: Sideshow Bob, Lionel Hutz, Troy McClure, Disco Stu and Fit TonyUncles: Chester Bouvier, Arthur Bouvier, Herman Bouvier, JoJo Bouvier and Lou GurneyAunts: Charlene Bouvier and Gladys GurneyMarital Aunt: Alfreda LeDouxCousins: Pierre Bouvier, Alfreda Bouvier II, Dorothé Bouvier, Rowena Bouvier, Tootsie Bouvier, Marnie Simpson and Dot Gurney",
    "first_appearance": "\"Simpsons Roasting on an Open Fire\"",
    "voiced_by": "Julie KavnerPamela Hayden (younger; \"Three Men and a Comic Book\")",
    "name": "Patty Bouvier"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Gray, naturally sandy blonde",
    "occupation": "Springfield DMV Employee",
    "relatives": "Parents: Clancy Bouvier and Jacqueline GurneySisters: Patty Bouvier and Marge BouvierUncles: Chester Bouvier, JoJo Bouvier, Arthur Bouvier, Herman Bouvier and Lou GurneyAunts: Charlene Bouvier and Gladys GurneyMarital Aunt: Alfreda LeDouxEx-Husbands: Sideshow Bob, Lionel Hutz, Troy McClure, Disco Stu, and Abraham SimpsonAdoptive Daughter: Ling BouvierNephew: Bart SimpsonNieces: Lisa Simpson and Maggie SimpsonGrandfathers: Pépé Bouvier and Ferdinand GurneyGrandmothers: Bambi Bouvier and Alvarine BisqueBrother-in-Law: Homer SimpsonCousins: Pierre Bouvier, Tootsie Bouvier, Dorothé Bouvier, Rowena Bouvier, Alfreda Bouvier II and Dot GurneyEx-Cousin-in-Law: Fat Tony",
    "first_appearance": "\"Simpsons Roasting on an Open Fire\"",
    "voiced_by": "Julie KavnerPamela Hayden (younger; \"Three Men and a Comic Book\")",
    "name": "Selma Bouvier"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Black",
    "occupation": "RV Salesman",
    "first_appearance": "The Call of the Simpsons",
    "voiced_by": "Albert Brooks (\"The Call of the Simpsons\")Dan Castellaneta (\"Mobile Homer\")",
    "name": "Cowboy Bob"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "Robert Terwilliger[1]Captain Bob[2]Walt Warren[3]\"Mayor Terwilliger\"[4][5]Wes Doobner[6]",
    "hair": "Red; once dyed aqua green[7]",
    "occupation": "Criminal Mastermind, Former Television Personality, Mayor of Springfield and Mayor of Salsiccia",
    "relatives": "Father: Robert Terwilliger Sr.Mother: Dame Judith UnderdunkBrother: Cecil TerwilligerWife: Francesca TerwilligerEx-wife: Selma BouvierSon: Gino TerwilligerNephew: Neil TerwilligerCousin: Bobby TerwilligerEx-sisters-in-Law: Patty Bouvier and Marge SimpsonEx-parents-in-Law: Jacqueline Bouvier and Clancy Bouvier (deceased)Ex-nephew: Bart SimpsonEx-nieces: Lisa Simpson and Maggie SimpsonFormer Step-Daugther: Ling Bouvier",
    "first_appearance": "\"The Telltale Head\"",
    "voiced_by": "Kelsey GrammerDan Castellaneta (impersonating Krusty the Clown in \"Krusty Gets Busted\")",
    "name": "Robert Terwilliger"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Black",
    "occupation": "TV personalityActress",
    "relatives": "Ex-Boyfriend: DuffmanFather: Bill",
    "first_appearance": "\"I'm Spelling as Fast as I Can\"",
    "voiced_by": "Tress MacNeille",
    "name": "Booberella"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Blond",
    "occupation": "Fourth grade student at Springfield Elementary School",
    "relatives": "Father: Mr. Borton Mother: Mrs. Borton",
    "first_appearance": "\"Simpsons Roasting on an Open Fire\"",
    "voiced_by": "Jo Ann HarrisPamela HaydenNancy CartwrightRussi TaylorGrey DeLisle",
    "name": "Wendell Borton"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Blonde",
    "occupation": "Student at Springfield Preparatory School",
    "relatives": "Father: Kent BrockmanStep-mother: Stephanie BrockmanSister: Unnamed[1]Grandfather: Unnamed[2]Grandmother: Unnamed[3]Aunt: UnnamedCousin: Unnamed[4]",
    "first_appearance": "\"Lisa vs. Malibu Stacy\"",
    "voiced_by": "Nancy Cartwright",
    "name": "Brittany Brockman"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Gray",
    "occupation": "Try-N-Save security guard",
    "first_appearance": "\"Marge Be Not Proud\"",
    "voiced_by": "Lawrence Tierney",
    "name": "Don Brodka"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "alias(es)": "Miss. BotzThe Babysitter Bandit",
    "hair": "Robin’s Egg Blue",
    "occupation": "CriminalBabysitter",
    "first_appearance": "\"Some Enchanted Evening\"",
    "voiced_by": "Penny Marshall",
    "name": "Lucille Botzcowski"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "Actor/TV Personality",
    "relatives": "Ex-wife: Señora Bumblebee ManParents: Unnamed (deceased)Girlfriend: Unnamed",
    "first_appearance": "\"Itchy & Scratchy: The Movie\"",
    "voiced_by": "Hank Azaria",
    "name": "Bumblebee Man"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "White",
    "occupation": "Currently: UnemployedFormerly: Salesman Employee at the Springfield Nuclear Power Plant",
    "relatives": "Father: Charles Montgomery BurnsMother: Lily Bancroft (deceased)Wife: Unnamed Children: Several unnamedGrandmothers: Daphne Burns (paternal grandmother)Mimsy Bancroft (maternal grandmother) Grandfather: Clifford Burns (paternal grandfather)",
    "first_appearance": "\"Burns, Baby Burns\"",
    "first_mentioned": "\"Boy Meets Curl\"",
    "voiced_by": "Rodney Dangerfield",
    "name": "Larry Burns"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "occupation": "Capital City baseball team mascot; state legislator",
    "first_appearance": "\"Dancin' Homer\"",
    "voiced_by": "Tom PostonKarl Wiedergott",
    "name": "Capital City Goofball"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "The Black One",
    "hair": "Black",
    "occupation": "Safety operations supervisor at the Springfield Nuclear Power Plant",
    "relatives": "Father: UnnamedSister: UnnamedAdoptive Father: Carl Carlson, Sr.Adoptive Mother: Sigrin SiguðardóttirWife: Mrs. Carlson",
    "first_appearance": "\"Homer's Night Out\"",
    "voiced_by": "Hank AzariaHarry Shearer (\"Homer's Night Out\" and \"Brush with Greatness\")",
    "name": "Carl Carlson"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "Wine MakerLeather MakerPoetExpert on Mustard",
    "relatives": "Nephew: Ugolin",
    "first_appearance": "\"The Crepes of Wrath\"",
    "voiced_by": "Harry ShearerHank Azaria (\"To Courier With Love\")",
    "name": "Cesar"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "Superintendent ChalmersChalmersSuper Nintendo ChalmersSorcerer Intendent ChalmersThe Super-Intendent",
    "hair": "Gray, balding",
    "occupation": "Super-duper-intendent of Springfield Elementary SchoolCo-Owner of Chalmskinn Productions",
    "relatives": "Wife: Rosemary Chalmers[2]Father: (name unknown) [3] Sister: Muriel Chalmers  Daughter: Shauna Chalmers[4]  Girlfriend: Agnes Skinner ",
    "first_appearance": "\"Whacking Day\"",
    "voiced_by": "Hank Azaria",
    "name": "Gary Chalmers"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Ginger",
    "occupation": "Dangerous Emissions Supervisor at the Springfield Nuclear Power Plant.",
    "relatives": "Wife: UnnamedSon: UnnamedDaughter: UnnamedSister: Unnamed",
    "first_appearance": "\"Life on the Fast Lane\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Charlie (SNPP)"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Gray",
    "occupation": "Ballet teacher",
    "first_appearance": "\"Smoke on the Daughter\"",
    "voiced_by": "Hank Azaria",
    "name": "Chazz Busby"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "hair": "BlackOrange",
    "occupation": "Co-Anchor for Channel 6 News",
    "first_appearance": "\"Krusty Gets Busted\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Scott Christian"
  },
  {
    "sex": "Male",
    "status": "Unknown",
    "hair": "Grey",
    "occupation": "Scientist",
    "first_appearance": "\"Marge vs. the Monorail\"",
    "voiced_by": "Harry Shearer",
    "name": "Sebastian Cobb"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Auburn",
    "occupation": "Student",
    "relatives": "Father: Unnamed",
    "first_appearance": "The Simpsons Movie",
    "voiced_by": "Tress MacNeille",
    "name": "Colin"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Bald",
    "occupation": "Supervillain",
    "relatives": "Ex-wife: Stacy Lovell",
    "first_appearance": "\"Lisa vs. Malibu Stacy\"",
    "voiced_by": "Hank Azaria",
    "name": "Dr. Hector von Colossus"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Gray",
    "occupation": "Waiter",
    "first_appearance": "\"The Parent Rap\"",
    "voiced_by": "Tress MacNeille",
    "name": "Cora"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Grey",
    "occupation": "Store owner of Costington's",
    "relatives": "Daughter: Melina CostingtonWife: Mrs. Costington",
    "first_appearance": "\"Trash of the Titans\"",
    "voiced_by": "Harry Shearer (debut)Hank Azaria",
    "name": "Mr. Costington"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Blue",
    "occupation": "Ventriloquist",
    "first_appearance": "\"Krusty Gets Kancelled\"",
    "voiced_by": "Hank Azaria",
    "name": "Arthur Crandall"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Black",
    "occupation": "Hired goon",
    "first_appearance": "\"Blood Feud\"",
    "voiced_by": "Hank Azaria",
    "name": "Joey Crusher"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Black",
    "occupation": "student",
    "relatives": "Father: UnnamedMother: Datebase's mother (unnamed)",
    "first_appearance": "\"Bart's Comet\"",
    "voiced_by": "Nancy CartwrightTress MacNeille  Pamela Hayden",
    "name": "Database"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "Documentary Filmmaker",
    "first_appearance": "\"'Scuse Me While I Miss the Sky\"",
    "voiced_by": "Eric Idle",
    "name": "Declan Desmond"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Gray",
    "occupation": "Music Teacher,Worker at Starving Teachers Moving Co.",
    "relatives": "Ex-Boyfriend: Dewey",
    "first_appearance": "\"Simpsons Roasting on an Open Fire\"",
    "voiced_by": "Harry Shearer",
    "name": "Dewey Largo"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Black",
    "occupation": "Bank Robber (currently in prison)",
    "relatives": "Mother: Unnamed",
    "first_appearance": "\"I Don't Wanna Know Why the Caged Bird Sings\"",
    "voiced_by": "Steve Buscemi",
    "name": "Dwight Diddlehopper"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown Afro",
    "occupation": "Owner of Stu's DiscoSea Captain (formerly)",
    "relatives": "Ex-wife: Selma BouvierEx-girlfriend: Unnamed",
    "first_appearance": "Two Bad Neighbors",
    "voiced_by": "Hank Azaria",
    "name": "Disco Stu"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "College Student",
    "first_appearance": "\"Homer Goes to College\"",
    "voiced_by": "Hank Azaria",
    "name": "Doug (nerd)"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "DuffmanJoeSidLarry",
    "hair": "Blond",
    "occupation": "Advertiser for Duff Beer",
    "relatives": "Ex-girlfriend: BooberellaDaughters: DuffgirlDuffman's daughter (estranged)Son: Dufflad",
    "first_appearance": "\"The City of New York vs. Homer Simpson\"",
    "voiced_by": "Hank Azaria",
    "name": "Duffman"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "Greg (by Wiggum)",
    "hair": "Stringy and baldBrown (\"Lisa on Ice\")",
    "occupation": "Unemployed, via \"Homer is where the Art Isn't\"",
    "relatives": "Ex-wife: Unnamed",
    "first_appearance": "\"There's No Disgrace Like Home\"",
    "voiced_by": "Harry ShearerGreg Berg (Bart vs. Thanksgiving)",
    "name": "Eddie"
  },
  {
    "sex": "Male",
    "status": "Fictional",
    "hair": "Various",
    "first_appearance": "\"Scary Movie\"",
    "voiced_by": "Nancy Cartwright",
    "name": "Happy Little Elves"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Black",
    "occupation": "Entertainer",
    "first_appearance": "\"$pringfield (Or, How I Learned to Stop Worrying and Love Legalized Gambling)\"",
    "voiced_by": "Harry Shearer",
    "name": "Ernst"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "hair": "Gray",
    "occupation": "Mob bossWaste Management (officially)",
    "relatives": "Wife: Anna Maria D'AmicoUncle: Fatso AntonioFather: The Sicilian Uncle of Fit TonySon: Michael D'AmicoCousin: Fit TonyEx-Cousin-in-Law: Selma Bouvier  Cousin-In-Law: UnnamedAunt: Angelica D'Amico[1]",
    "first_appearance": "\"Bart the Murderer\"",
    "death_episode": "\"Donnie Fatso\"",
    "cause_of_death": "He was high.",
    "voiced_by": "Joe MantegnaPhil Hartman (\"A Fish Called Selma\") Mike Myers (\"Donnie Fatso\")",
    "name": "Fat Tony"
  },
  {
    "sex": "Male",
    "status": "Fictional",
    "alias(es)": "Rod Runtledge",
    "voiced_by": "Harry ShearerDan Castellaneta",
    "name": "Fallout Boy"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "Mobster",
    "first_appearance": "\"Insane Clown Poppy\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Frankie the Squealer"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "hair": "Salmon",
    "occupation": "Housewife (former)The Leftorium (former)Creator of Praiseland (closed)",
    "location": "744 Evergreen Terrace",
    "relatives": "Grandmother: UnnamedMother: UnnamedSons: Rod and Todd FlandersHusband: Ned FlandersMother-in-Law: Agnes Flanders Father-in-Law: Nedsel Flanders",
    "first_appearance": "\"Dead Putting Society\"",
    "voiced_by": "Maggie Roswell (1990–1999; 2002–present)Marcia Mitzman Gaven (1999–2000)",
    "name": "Maude Flanders"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Red",
    "occupation": "Student at Springfield Elementary School",
    "relatives": "Parents: Ned and Maude Flanders (deceased)Stepmothers: Edna and Ginger FlandersBrother: Todd FlandersAunt: Nediana FlandersUnknown ex-uncle-in-law Grandmothers: Agnes Flanders and Maude Flanders' mother                                                                              Grandfather: Nedsel Flanders",
    "first_appearance": "\"Simpsons Roasting on an Open Fire\"",
    "voiced_by": "Pamela Hayden",
    "name": "Rod Flanders"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Auburn",
    "occupation": "Student at Springfield Elementary SchoolStudent at a religious private school (formerly)",
    "relatives": "Parents: Ned and Maude Flanders (deceased) Stepmothers: Edna and Ginger FlandersBrother: Rod FlandersAunt: Nediana FlandersGrandmothers: Agnes Flanders and Maude Flanders' motherGreat-Grandmother: Grandma Flanders",
    "first_appearance": "Simpsons Roasting on an Open Fire",
    "voiced_by": "Nancy Cartwright",
    "name": "Todd Flanders"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "alias(es)": "Lunchlady DorisLunchlady DoraDora Freedman",
    "hair": "Brown, naturally gray",
    "occupation": "Cafeteria chef and nurse at Springfield Elementary School",
    "relatives": "Son: Jeremy FreedmanHusband: Richard Freedman (deceased)",
    "first_appearance": "\"Lisa's Pony\"",
    "voiced_by": "Doris Grau (1991-1995; 1996 (\"Team Homer\"); 1997 (\"Lisa's Sax\")Tress MacNeille (2006-present)",
    "name": "Doris Freedman"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "ProfessorInventorCollege Professor at Springfield Heights Institute of Technology",
    "relatives": "Father: Jonathan Frink Sr.Son: Unnamedwife: Mrs. Frink Ex-girlfriend: Miss WyomingLovers: Cookie Kwan,[1] Nookie Kwan,[1] Elizabeth Hoover[1]",
    "first_appearance": "\"Old Money\"",
    "voiced_by": "Hank AzariaKarl Wiedergott",
    "name": "Jonathan Frink"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Bald",
    "occupation": "Prince",
    "first_appearance": "\"Treehouse of Horror XII\"",
    "voiced_by": "Harry Shearer",
    "name": "Frog Prince"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Orange",
    "occupation": "TV personality",
    "first_appearance": "\"Krusty Gets Kancelled\"",
    "voiced_by": "Hank Azaria",
    "name": "Gabbo"
  },
  {
    "sex": "Male",
    "hair": "Black",
    "occupation": "College Student",
    "first_appearance": "\"Homer Goes to College\"",
    "voiced_by": "Harry Shearer",
    "name": "Gary (nerd)"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "Student",
    "relatives": "Mother: UnnamedSister: KatelynFather: UnnamedStepfather: Unnamed",
    "first_appearance": "\"Marge Be Not Proud\"",
    "voiced_by": "Tress MacNeille",
    "name": "Gavin"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "hair": "Grayish-blue",
    "occupation": "Church OrganistSuperhero",
    "relatives": "Brother: Asa (deceased)Husband: Mr. Glick (deceased)",
    "first_appearance": "\"Three Men and a Comic Book\"",
    "voiced_by": "Cloris Leachman (First appearance)Tress MacNeille (Other appearances)",
    "name": "Alice Glick"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "Police Officer",
    "relatives": "Husband: Snake  Ex-fiancé: Mr. Burns  Ex-stepson : Jeremy Jailbird  Child: Unnamed Ex-brother-in-law : Unnamed",
    "first_appearance": "\"A Hunka Hunka Burns in Love\"",
    "voiced_by": "Julia Louis-Dreyfus",
    "name": "Gloria Jailbird"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Dark brown",
    "relatives": "HusbandSonSonDaughter",
    "first_appearance": "\"Sex, Pies, and Idiot Scrapes\"",
    "voiced_by": "Maggie Roswell",
    "name": "Gloria (White Christmas Blues)"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown",
    "relatives": "Gloria (wife)SonSonDaughter",
    "first_appearance": "\"Sex, Pies, and Idiot Scrapes\"",
    "name": "Gloria's Husband"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "The Big Cheese (By Bart) [1]Mr. Lord (By Marge) [2]",
    "hair": "White",
    "occupation": "Omnipotent creator and overseer of the universe",
    "relatives": "Son: Jesus ChristCreations: Adam and Eve",
    "first_appearance": "\"Homer The Heretic\"",
    "voiced_by": "Harry ShearerPhil Hartman (\"Bart Gets Hit by a Car\")",
    "name": "God"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown",
    "relatives": "Ex-boyfriend: Julio",
    "first_appearance": "\"Three Gays of the Condo\"",
    "voiced_by": "Scott Thompson",
    "name": "Grady"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "alias(es)": "Grimey",
    "hair": "Black",
    "occupation": "Nuclear Power Plant employee (Sector 7-G) (formerly)",
    "relatives": "Son: Frank Grimes, Jr.Parental partner: Mrs. Grimes",
    "first_appearance": "\"Homer's Enemy\"",
    "voiced_by": "Hank Azaria",
    "name": "Frank Grimes"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Black",
    "occupation": "Mechanic",
    "relatives": "Father: Frank Grimes Sr.Mother: Mrs. Grimes",
    "first_appearance": "\"The Great Louse Detective\"",
    "voiced_by": "Hank Azaria",
    "name": "Frank Grimes, Jr."
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Gray",
    "occupation": "Creator of Futurama & Life in HellCartoonist",
    "first_appearance": "\"The Front\"",
    "voiced_by": "Dan CastellanetaHimself",
    "name": "Matt Groening (character)"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown (season 1, episodes 8 and 10 and seasons 2-present)Blond (season 1, episodes 1, 3-4, 6 and 13)",
    "occupation": "Unemployed",
    "relatives": "Parents: Arnie and Mrs. GumblePaternal Uncle: Al Gumble",
    "first_appearance": "Simpsons Roasting on an Open Fire",
    "voiced_by": "Dan Castellaneta Shelby Grimm (singing)[2]",
    "name": "Barney Gumble"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "Old Gil",
    "hair": "Gray",
    "occupation": "VariousRed Blazer Realty (former)",
    "relatives": "Brother: Unnamed[1]Ex-wife: Shirley GundersonSons: Rodney Gunderson and Adam GundersonDaughter: Tara Gunderson  Granddaughter:  Unnamed[2]",
    "first_appearance": "Realty Bites",
    "voiced_by": "Dan Castellaneta",
    "name": "Gil Gunderson"
  },
  {
    "sex": "Male",
    "hair": "Blond",
    "occupation": "Entertainer",
    "first_appearance": "\"$pringfield (Or, How I Learned to Stop Worrying and Love Legalized Gambling)\"",
    "voiced_by": "Hank Azaria",
    "name": "Gunter"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Blue and tufty",
    "occupation": "Performer",
    "first_appearance": "\"Bart the Fink\"",
    "name": "Handsome Pete"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "alias(es)": "Super Nasty Witch (by Homer)",
    "hair": "Brown",
    "occupation": "Judge",
    "relatives": "Husband: Unnamed Grandmother: Unnamed",
    "first_appearance": "\"The Parent Rap\"",
    "voiced_by": "Jane Kaczmarek",
    "name": "Judge Constance Harm"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "Owner of Herman's Military Antiques",
    "first_appearance": "\"Bart the General\"",
    "voiced_by": "Harry Shearer",
    "name": "Herman Hermann"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Black",
    "occupation": "Housewife",
    "relatives": "Husband: Julius HibbertSons: Dr. Hibbert's First SonDr. Hibbert's Second SonDr. Hibbert's Third SonDaughters: Dr. Hibbert's First DaughterDr. Hibbert's Second DaughterBrother: Chester Dupree",
    "first_appearance": "\"Bart's Dog Gets an F\"",
    "voiced_by": "Tress MacNeille",
    "name": "Bernice Hibbert"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Black",
    "occupation": "Doctor at Springfield General HospitalOwner at M.D. Family Practice",
    "relatives": "Wife: Bernice HibbertSons: Dr. Hibbert's First SonDr. Hibbert's Second SonDr. Hibbert's Third SonDaughters: Dr. Hibbert's First DaughterDr. Hibbert's Second DaughterBrothers: Bleeding Gums Murphy and Hermano HibbertFather: Julius Hibbert's father",
    "first_appearance": "\"Bart the Daredevil\"",
    "voiced_by": "Harry Shearer",
    "name": "Julius Hibbert"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Brown, formerly blue and red",
    "occupation": "Teacher at Springfield Elementary School",
    "relatives": "Boyfriend: UnnamedLover: Jonathan Frink[1]",
    "first_appearance": "\"Brush with Greatness\"",
    "first_mentioned": "\"Bart the General\"",
    "voiced_by": "Maggie RoswellMarcia Mitzman Gaven",
    "name": "Elizabeth Hoover"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "Miguel Sanchez or Dr. Nguyen Van Phuoc",
    "hair": "Brown",
    "occupation": "Lawyer  Realtor  Estate Executor  Shoe Repairer",
    "relatives": "Ex-wife: Selma Bouvier",
    "first_appearance": "\"Bart Gets Hit by a Car\"",
    "voiced_by": "Phil Hartman † (1991-1997)",
    "name": "Lionel Hutz"
  },
  {
    "species": "Mouse",
    "gender": "Male",
    "status": "Fictional",
    "color": "Blue",
    "owner": "Chester J. Lampwick (Original) Roger Meyers, Jr. (stolen)",
    "relatives": "Brother: Catchy Sister: Lady ItchySon: Itchy Jr.Grandpa: Micro Itches",
    "occupation": "Cartoon mouse",
    "first_appearance": "The Bart Simpson Show",
    "voiced_by": "Dan Castellaneta",
    "name": "Itchy"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "Teacher (formerly)Prison Guard",
    "first_appearance": "\"Blazed and Confused\"",
    "voiced_by": "Willem Dafoe",
    "name": "Jack Lassen"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Ginger",
    "relatives": "Father: Snake Jailbird  Mother: Unnamed  Ex-stepmother: Gloria Jailbird  a half-brother or a half-sister  Uncle :Unnamed",
    "first_appearance": "\"Pygmoelian\"",
    "voiced_by": "Tress MacNeille",
    "name": "Jeremy Jailbird"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "CriminalWallet Inspector (self professed)Former archaeologist",
    "relatives": "Ex-Wives: Gloria Jailbird and UnnamedBrother: UnnamedSon: Jeremy JailbirdChild: (with Gloria) UnnamedGirlfriend: Shoshanna",
    "first_appearance": "\"The War of the Simpsons\"",
    "voiced_by": "Hank Azaria",
    "name": "Snake Jailbird"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Light blue (formerly brown)",
    "occupation": "Barber",
    "first_appearance": "\"Bart's Haircut\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Jake the Barber"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "Bowling Instructor (Formerly)",
    "first_appearance": "\"Life on the Fast Lane\"",
    "voiced_by": "Albert Brooks",
    "name": "Jacques"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "Comic Book Guy",
    "hair": "Half receded, Long, Brown",
    "occupation": "Owner of The Android's Dungeon & Baseball Card Shop",
    "relatives": " Wife: KumikoAdopted son: PriusCousins: Comic Book Gay and Graphic Novel KidEx-girlfriends: Edna Krabappel and Agnes SkinnerBrother-in-law: UnnamedFather-in-law: Kumiko's fatherMother-in-law: Michiko",
    "first_appearance": "Three Men and a Comic Book",
    "voiced_by": "Hank Azaria",
    "name": "Comic Book Guy"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Ginger",
    "occupation": "Various",
    "relatives": "Mother: Lunchlady Doris[1]",
    "first_appearance": "\"Brush with Greatness\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Jeremy Freedman"
  },
  {
    "sex": "Male",
    "hair": "Black",
    "occupation": "Jeans Counterfeit",
    "relatives": "Unknown",
    "first_appearance": "\"The Springfield Connection\"",
    "voiced_by": "Hank Azaria",
    "name": "Jericho"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Gray",
    "occupation": "Mobster",
    "first_appearance": "\"Bart The Murderer\"",
    "voiced_by": "Phil HartmanDan Castellaneta (\"Homie The Clown\")",
    "name": "Joey (mafia)"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Black Blonde in \"The Fool Monty\"",
    "occupation": "Owner of Cockamamie's Collectibles Shop",
    "relatives": "Ex-Boyfriend: Waylon Smithers, Jr.",
    "first_appearance": "\"Homer's Phobia\"",
    "voiced_by": "John Waters",
    "name": "John (Homer's Phobia)"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Long, brown, bald spot (Sometimes)",
    "occupation": "StudentSchool BullySimpson's Teenage Family",
    "relatives": "Father: Mr. JonesStepfather: GunnarMother: Carol JonesSister: UnnamedEx-girlfriends: Darcy, Laura Powers and Shauna",
    "first_appearance": "\"The Telltale Head\"",
    "voiced_by": "Pamela Hayden (Seasons 2-Present)Tress MacNeille (The Telltale Head, When Flanders Failed, Brother from Another Series and The Kids Are All Fight)",
    "name": "Jimbo Jones"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "Lead singer of Kovenant",
    "first_appearance": "\"Alone Again, Natura-Diddily\"",
    "voiced_by": "Shawn Colvin",
    "name": "Rachel Jordan"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Varies",
    "occupation": "Photographer",
    "relatives": "Husband: ThadEx-wife: Adriatica Vel Johnson Ex-boyfriends: GradySmithersLover (formerly): Comic Book Gay",
    "first_appearance": "\"Three Gays of the Condo\"",
    "voiced_by": "Hank Azaria",
    "name": "Julio"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "occupation": "Interstellar invader",
    "relatives": "Sister: KodosDaughter: Maggie Simpson (non-canon) Niece: Kamala (non-canon).Girlfriend Selma Bouvier",
    "first_appearance": "\"Treehouse of Horror\"",
    "voiced_by": "Harry Shearer",
    "name": "Kang"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "alias(es)": "Shauna Tifton (real name)April Flowers",
    "hair": "Ginger/Auburn",
    "occupation": "Exotic dancer",
    "first_appearance": "\"Homer's Night Out\"",
    "voiced_by": "Maggie Roswell",
    "name": "Princess Kashmir"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "White (Formerly Black)",
    "occupation": "Channel 6 anchorman",
    "relatives": "Ex-Wife: Stephanie BrockmanDaughters: Brittany BrockmanUnnamed[1]Father: Unnamed[2]Mother: Unnamed[3]Sister: UnnamedNephew: Unnamed[4]",
    "first_appearance": "\"Krusty Gets Busted\"",
    "voiced_by": "Harry Shearer",
    "name": "Kent Brockman"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "occupation": "Interstellar invader",
    "relatives": "Brother: KangNiece: KamalaDaughter: Maggie Simpson (non-canon)",
    "first_appearance": "\"Treehouse of Horror\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Kodos"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "Michael Jackson",
    "hair": "Bald",
    "occupation": "Mental patient",
    "relatives": "Unnamed brotherUnnamed sisters",
    "first_appearance": "\"Stark Raving Dad\"",
    "voiced_by": "Michael Jackson (credited as \"John Jay Smith\"; ruined speaking voice)Kipp Lennon (ruined singing voice)Hank Azaria (real voice)",
    "name": "Leon Kompowsky"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Grey",
    "occupation": "Gym Teacher",
    "relatives": "Wife: Mrs. KruptSon: UnnamedDaughter: Unnamed",
    "first_appearance": "\"My Fair Laddy\"",
    "voiced_by": "Hank Azaria",
    "name": "Coach Krupt"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "hair": "Gray (formerly red)",
    "occupation": "Rabbi",
    "relatives": "Father: Rabbi Zev KrustofskySon: Krusty Daughter: Barbara Van Horne Daughter: GinaEx-daughters-in-law : Holly Hippie, Eartha Kitt, Mia Farrow and 12 others, unnamed  Granddaughter: Sophie KrustofskiGrandchildren : Many unnamed  Grandson: Josh, Chin Ho and Chan Ho Ex-wife: Rachel Krustofsky",
    "first_appearance": "\"Like Father, Like Clown\"",
    "voiced_by": "Jackie MasonDan Castellaneta",
    "name": "Rabbi Hyman Krustofsky"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Black",
    "occupation": "Owner of the Android's Dungeon & Baseball Card ShopManga artist",
    "relatives": "Husband: Comic Book Guy  Mother: Michiko  Father: Mr. Nakamura Adoptive stepson: Prius",
    "first_appearance": "\"Married to the Blob\"",
    "voiced_by": "Tress MacNeille",
    "name": "Kumiko Albertson"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Black",
    "occupation": "Realtor",
    "relatives": "Cousin: Nookie Kwan[1]Son: UnnamedLovers: Joe Quimby, Jonathan Frink",
    "first_appearance": "\"Realty Bites\"",
    "voiced_by": "Tress MacNeille",
    "name": "Cookie Kwan"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Grey",
    "occupation": "Cartoonist",
    "first_appearance": "\"The Day the Violence Died\"",
    "voiced_by": "Kirk Douglas",
    "name": "Chester J. Lampwick"
  },
  {
    "sex": "Male",
    "hair": "Brownish Orange",
    "occupation": "Advertiser for Lard Lad Donuts",
    "first_appearance": "\"Treehouse of Horror VI\"",
    "voiced_by": "Godzilla (roar)",
    "name": "Lard Lad"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Black, balding",
    "relatives": "Daughters: 2 Unnamed",
    "first_appearance": "\"Simpsons Roasting on an Open Fire\"",
    "voiced_by": "Harry Shearer",
    "name": "Larry (barfly)"
  },
  {
    "sex": "Male",
    "status": "Unknown",
    "hair": "Red",
    "occupation": "Cult leader/Scam Artist",
    "first_appearance": "\"The Joy of Sect\"",
    "voiced_by": "Hank Azaria",
    "name": "The Leader"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown (formerly black)",
    "occupation": "Mobster",
    "relatives": "Sister: Unnamed",
    "first_appearance": "\"Bart the Murderer\"",
    "voiced_by": "Harry ShearerHank Azaria (formerly)",
    "name": "Legs"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "Technical Supervisor at the Springfield Nuclear Power Plant, actor from The Re-Deadening",
    "relatives": "Father: Unnamed (deceased)Mother: Mrs. LeonardGrandmother: Unnamed (deceased)Sister: Unnamed (deceased)Girlfriend: Unnamed",
    "first_appearance": "Life on the Fast Lane",
    "voiced_by": "Harry Shearer Hank Azaria (\"Homer's Night Out\")Dan Castellaneta (\"The Simpsons Guy\")",
    "name": "Lenny Leonard"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Black (balding)",
    "occupation": "Assistant Superintendent",
    "relatives": "Unknown",
    "first_appearance": "\"Sweet Seymour Skinner's Baadasssss Song\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Leopold"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Orange",
    "relatives": "Wife: Gypsy Cousin: Northern Irish Leprechaun",
    "voiced_by": "Dan Castellaneta",
    "name": "Leprechaun"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Black",
    "occupation": "Student",
    "relatives": "Mother: Mrs. ClarkFather: Mr. ClarkGrandfather: Unnamed",
    "first_appearance": "\"Simpsons Roasting on an Open Fire\"",
    "voiced_by": "Jo Ann Harris  Nancy Cartwright  Pamela Hayden Russi Taylor Tress MacNeille",
    "name": "Lewis Clark"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Black",
    "location": "Springfield",
    "relatives": "Biological Mother: UnnamedBiological Father: UnnamedAdoptive Mother: Selma BouvierAdoptive Marital Uncle/Father: Homer SimpsonAdoptive Aunts: Patty Bouvier and Marge SimpsonAdoptive Grandfather: Clancy BouvierAdoptive Grandmother: Jacqueline BouvierAdoptive Cousins/Half-Siblings: Bart Simpson, Lisa Simpson and Maggie Simpson",
    "first_appearance": "\"Goo Goo Gai Pan\"",
    "voiced_by": "Nancy Cartwright",
    "name": "Ling Bouvier"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Blue",
    "occupation": "Art Teacher",
    "first_appearance": "\"Brush with Greatness\"",
    "voiced_by": "Jon Lovitz",
    "name": "Professor Lombardo"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Black",
    "occupation": "Police Sergeant",
    "relatives": "Ex-wife: Amy  Ex-girlfriend: Charquelle  Son: Unnamed",
    "first_appearance": "\"There's No Disgrace Like Home\"",
    "voiced_by": "Hank AzariaHarry Shearer (\"Bart vs. Thanksgiving\")",
    "name": "Lou"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Black",
    "occupation": "Mafia member",
    "relatives": "Ex-Wife: MarshaWife: UnnamedMother: UnnamedSon: Louie Jr.",
    "first_appearance": "\"Bart the Murderer\"",
    "voiced_by": "Dan CastellanetaHarry Shearer (Chief of Hearts)",
    "name": "Louie (mafia)"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Gray",
    "occupation": "Housewife",
    "relatives": "Husband: Reverend Timothy LovejoyDaughter: Jessica LovejoyFather-in-law: Timothy Lovejoy, Sr.Cousin: Stanlerina",
    "first_appearance": "Life on the Fast Lane",
    "voiced_by": "Maggie RoswellMarcia Mitzman GavenTress MacNeille (one line in Team Homer)",
    "name": "Helen Lovejoy"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Black",
    "occupation": "Student",
    "relatives": "Parents: Timothy and Helen LovejoyPaternal Grandfather: Timothy Lovejoy, Sr.",
    "first_appearance": "\"Simpsons Roasting on an Open Fire\" (where she had black'ly purple hair and brown skin)",
    "voiced_by": "Meryl Streep",
    "name": "Jessica Lovejoy"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Bald",
    "occupation": "Hired goon",
    "first_appearance": "\"Dog of Death\"",
    "voiced_by": "Hank Azaria",
    "name": "Lowblow"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Blue",
    "occupation": "Housewife",
    "relatives": "Parents: Southern Cracker Manager and Nana Sophie MussoliniSon: Milhouse Van HoutenHusband(cousin): Kirk Van Houten, 1976-1996, 2007-presentEx-lover: GyroEx-boyfriend: PyroHalf-Brother: Bastardo MussoliniSister: Mrs. MussoliniBrother-in-Law: Norbert Van HoutenFather-in-Law: Grandpa Van HoutenMother-in-Law: Grandma Van HoutenStepmother-in-Law: Grandpa Van Houten's Second WifeNiece: Annika Van Houten",
    "first_appearance": "Homer Defined",
    "voiced_by": "Maggie Roswell",
    "name": "Luann Van Houten"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "Gymnastics Instructor at Lugash's Gym",
    "first_appearance": "\"Children of a Lesser Clod\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Lugash"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Blonde",
    "occupation": "Country MusicianBarmaid",
    "relatives": "Father: Royce LumpkinMother: UnnamedHusband: Unnamed, but resembles HomerEx-husbands: All unnamed, but resemble Homer",
    "first_appearance": "\"Colonel Homer\"",
    "voiced_by": "Beverly D'AngeloDoris Grau (\"Marge vs. the Monorail\")",
    "name": "Lurleen Lumpkin"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "hair": "Blond",
    "occupation": "Con Artist",
    "first_appearance": "\"Marge vs. the Monorail\"",
    "voiced_by": "Phil Hartman",
    "name": "Lyle Lanley"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "Sea Captain",
    "hair": "Grey",
    "occupation": "EntrepreneurPeriscope operator",
    "relatives": "Son: UnnamedDaughter: Unnamed[1]Mother: Unnamed (wood)Fiancée: Mermaid StatueEx-wife: Agnes Skinner\"Estranged Wife\": Tenille[2]",
    "first_appearance": "\"New Kid on the Block\"",
    "voiced_by": "Hank Azaria",
    "name": "Horatio McCallister"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Dark auburn",
    "occupation": "Patient for Nick Riviera",
    "first_appearance": "\"Homer's Triple Bypass\"",
    "voiced_by": "Hank Azaria",
    "name": "Mr. McGreg"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "Springfield Nuclear Power Plant employee[1]Naval Recruiter",
    "first_appearance": "\"When Flanders Failed\"",
    "voiced_by": "Hank Azaria",
    "name": "Just Stamp the Ticket Man"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Gray",
    "occupation": "Former: Nuclear Power Plant workerCurrent: Janitor",
    "first_appearance": "\"Marge Gets a Job\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Jack Marley"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Orange",
    "occupation": "KBBL radio DJ",
    "first_appearance": "\"Bart Gets an \"F\"\" (voices only)\"Bart vs. Thanksgiving\" (in person)",
    "voiced_by": "Harry Shearer",
    "name": "Marty (KBBL DJ)"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "Bodyguards",
    "first_appearance": "\"Three Men and a Comic Book\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Mayor Quimby's Body Guards"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Ginger",
    "occupation": "Actor",
    "relatives": "Ex-wife: Selma Bouvier",
    "first_appearance": "\"Homer vs. Lisa and the 8th Commandment\"",
    "voiced_by": "Phil Hartman † (1991-1998)Dan Castellaneta (\"Bart's Dog Gets an F\" and \"Mr. Lisa Goes to Washington\")",
    "name": "Troy McClure"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Green",
    "occupation": "Children's entertainerTV Personality",
    "relatives": "Father: NormanMother: LucilleWife: Unnamed[2]Ex-wife: Barbara KrustofskySons: \"Master\" Warren Van Horne and JoshDaughter: \"Lady\" Becca Van Horne",
    "first_appearance": "\"Itchy & Scratchy & Marge\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Melvin Van Horne"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Blue",
    "occupation": "Chairman of I&S Studios",
    "relatives": "Father: Roger Meyers, Sr.",
    "first_appearance": "\"Itchy & Scratchy & Marge\"",
    "voiced_by": "Alex Rocco †Hank Azaria(The Front)(Itchy & Scratchy Land)",
    "name": "Roger Meyers, Jr."
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Black",
    "occupation": "Owner of Coolsville Comics & Toys",
    "relatives": "Wife: StrawberryUnnamed baby",
    "first_appearance": "\"Husbands and Knives\"",
    "voiced_by": "Jack Black (\"Husbands and Knives\") Maurice LaMarche (\"Married to the Blob\")",
    "name": "Milo"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Bald, formerly black",
    "occupation": "VariousSuperheroKing of the Mole PeopleMayor of Springfield (formerly)",
    "relatives": "Father: Mr. MolemanEx-girlfriends: Selma Bouvier and Doris FreedmanEx-wife: UnnamedSon: UnnamedDaughter: Unnamed",
    "first_appearance": "\"Scary Movie\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Hans Moleman"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Black",
    "occupation": "Doctor  Psychologist",
    "relatives": "Brother: Mervin Monroe",
    "first_appearance": "\"There's No Disgrace Like Home\"",
    "voiced_by": "Harry Shearer",
    "name": "Marvin Monroe"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "Tattoo Parlor GuySkin artistTattoo guyOl' Tremble Fingers",
    "hair": "Bald",
    "occupation": "Tattoo artist",
    "relatives": "Brother: Marvin MonroeEx-girlfriend: Tattoo Annie[1]",
    "first_appearance": "\"Simpsons Roasting on an Open Fire\"",
    "voiced_by": "Harry Shearer",
    "name": "Mervin Monroe"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "Student at Springfield ElementarySinger at Party Posse (formerly)Kidz Newz (formerly)",
    "relatives": "Father: Eddie MuntzMother: Mrs. MuntzParental Grandfather: Judge MuntzSister: Maureen Muntz (possibly deceased and killed by Nelson)[1]Half-Brother: Norman[2]Grandmother: UnnamedCousins: Chuck Muntz and Reilly MuntzSon Sherri and Terris unnamed sons",
    "first_appearance": "\"Simpsons Roasting on an Open Fire\"",
    "voiced_by": "Pamela Hayden (\"Bart the General\")Nancy CartwrightMarc Terenzi (\"New Kids on the Blecch\")",
    "name": "Nelson Muntz"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "Former Circus Attraction",
    "relatives": "Ex-wife: Mrs. MuntzSons: Nelson Muntz and NormanDaughter: Maureen MuntzFather: Judge MuntzBrother: Chuck MuntzMother: MichelleNephews: Reilly Muntz, 1 Jeremy and Chuck Muntz Jr.",
    "first_appearance": "Brother from the Same Planet",
    "voiced_by": "Phil Hartman (1993-1998)Harry Shearer (1998-present)Hank Azaria (1998-present)Earl Mann (\"22 For 30\")",
    "name": "Eddie Muntz"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "Classy Girls Strip Club Pole Dancer",
    "relatives": "Son: Nelson Muntz Daughter: Maureen Muntz (possibly deceased)[1]Ex-husband: Eddie Muntz  Husband: Clown",
    "first_appearance": "Voice: \"Wild Barts Can't Be Broken\"  Person: \"'Tis the Fifteenth Season\"",
    "voiced_by": "Tress MacNeille",
    "name": "Mrs. Muntz"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Gray",
    "occupation": "Stunt Devil",
    "first_appearance": "Bart the Daredevil",
    "voiced_by": "Dan Castellaneta",
    "name": "Captain Lance Murdock"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "alias(es)": "Bleeding Gums Murphy",
    "hair": "Brown, balding",
    "occupation": "Musician",
    "relatives": "Brothers: Julius Hibbert and Hermano Hibbert (unconfirmed)Father: Unnamed father (unconfirmed) Nephews: Unnamed nephew, unnamed nephew, unnamed nephew (unconfirmed) Niece: Unnamed niece (unconfirmed)",
    "first_appearance": "\"Moaning Lisa\"",
    "voiced_by": "Ron TaylorDaryl L. Coley",
    "name": "Bleeding Gums Murphy"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Blonde (currently, presumably dyed)Brown (formerly)",
    "occupation": "Various",
    "first_appearance": "The Itchy & Scratchy & Poochie Show",
    "voiced_by": "Tress MacNeille",
    "name": "Lindsey Naegle"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Black",
    "occupation": "HousewifePart-time Kwik-E-Mart employee",
    "relatives": "Husband: ApuChildren: The Nahasapeemapetilon OctupletsBrother-in Law: Sanjay NahasapeemapetilonMother-in Law: Apu's MotherFather: UnnamedMother: UnnamedSister: SarahSister: LannaNephew: Brein",
    "first_appearance": "\"Much Apu About Nothing\"",
    "voiced_by": "Jan Hooks †Tress MacNeille",
    "name": "Manjula Nahasapeemapetilon"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Black",
    "occupation": "Sales Clerk at the Kwik-E-Mart",
    "relatives": "Brothers: Apu and Tikku Nahasapeemapetilon Wife: Jeanette Nahasapeemapetilon  Daughters: Pahusacheta Nahasapeemapetilon  Sons: Jamshed Nahasapeemapetilon  Nephews and Nieces: The Nahasapeemapetilon Octuplets  Father: Apu Nahasapeemapetilon Sr.  Cousins: Kavi  Mother: Mrs Nahasapeemapetilon",
    "first_appearance": "\"Homer vs. Lisa and the 8th Commandment\"",
    "voiced_by": "Harry Shearer",
    "name": "Sanjay Nahasapeemapetilon"
  },
  {
    "name": "The Nahasapeemapetilon Octuplets"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "Crazy GuyCrazy Old Man",
    "hair": "Gray, balding",
    "occupation": "Retired (currently)Casablanca studio executive (formerly)",
    "relatives": "Brother: Irving (deceased)  Wife: Hazel (deceased)[1]  Uncle: Bill (Old Jewish Man's Uncle) (deceased)[2] Son: Unnamed",
    "first_appearance": "\"Bart the General\"",
    "voiced_by": "Hank Azaria Dan Castellaneta (\"Miracle on Evergreen Terrace\")",
    "name": "Old Jewish Man"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "Number 1",
    "occupation": "Leader of the StonecuttersSecurity Guard at Star Trek Museum",
    "first_appearance": "\"Homer the Great\"",
    "voiced_by": "Patrick Stewart",
    "name": "Number One"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Black",
    "occupation": "Talk Show Host",
    "first_appearance": "Ice Cream of Margie (with the Light Blue Hair)",
    "voiced_by": "Tress MacNeille",
    "name": "Opal"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Black",
    "occupation": "School bus driver",
    "relatives": "Father: Admiral MannMother: Mrs. MannBrother: Henry Mann[1]Ex-fiancée: BeckyEx-husband (Movementarianism): Barney Gumble",
    "first_appearance": "\"Homer's Odyssey\"",
    "voiced_by": "Harry Shearer",
    "name": "Otto Mann"
  },
  {
    "sex": "Male",
    "hair": "Black",
    "occupation": "Media Agent",
    "first_appearance": "\"A Fish Called Selma\"",
    "voiced_by": "Jeff Goldblum",
    "name": "MacArthur Parker"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "Orphan",
    "relatives": "Mother: UnnamedSister: Poor Violet",
    "first_appearance": "\"Miracle on Evergreen Terrace\"",
    "voiced_by": "Pamela Hayden",
    "name": "Patches"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Purple",
    "occupation": "Krusty the Clown's personal assistant",
    "first_appearance": "\"Like Father, Like Clown\"",
    "voiced_by": "Pamela Hayden",
    "name": "Lois Pennycandy"
  },
  {
    "sex": "Female",
    "hair": "Blonde",
    "occupation": "Convict",
    "relatives": "Husband: Unnamed",
    "first_appearance": "\"Marge in Chains\"",
    "voiced_by": "Tress MacNeille",
    "name": "Phillips"
  },
  {
    "species": "Pig",
    "gender": "Male",
    "status": "Alive",
    "color": "Pink (skin)White (hair)",
    "owner": "Homer Simpson",
    "first_appearance": "The Simpsons Movie",
    "voiced_by": "Tress MacNeille",
    "name": "Plopper"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Blonde",
    "occupation": "Springfield Elementary Gym TeacherEmployee at Starving Teachers Moving Co.",
    "first_appearance": "\"Stark Raving Dad\"",
    "first_mentioned": "\"The PTA Disbands\"",
    "name_seen": "\"The Fool Monty\"",
    "voiced_by": "Tress MacNeille",
    "name": "Brunella Pommelhorst"
  },
  {
    "species": "Dog",
    "gender": "Male",
    "status": "Fictional",
    "color": "Orange fur, black hair, purple hat, teal sweatshirt",
    "owner": "Roger Meyers, Jr.",
    "first_appearance": "\"The Itchy & Scratchy & Poochie Show\"",
    "voiced_by": "Dan CastellanetaAlex Rocco",
    "name": "Poochie"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "Home-makerWomen's Bodybuilding Champ",
    "relatives": "Daughter: Laura PowersEx-Husband: Mr. PowersNeice: Unnamed",
    "first_appearance": "\"New Kid on the Block\"",
    "voiced_by": "Pamela Reed  Pamela Hayden",
    "name": "Ruth Powers"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Dark Brown",
    "occupation": "Student",
    "relatives": "Father: Mr. PowellMother: Mrs. Powell",
    "first_appearance": "\"Moaning Lisa\"",
    "voiced_by": "Pamela HaydenTress MacNeille[1]",
    "name": "Janey Powell"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Blue",
    "relatives": "Husband: Martin Prince Sr.Son: Martin Prince",
    "first_appearance": "Bart the Genius",
    "voiced_by": "Russi TaylorTress MacNeille[1]",
    "name": "Martha Prince"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "Martin PrissMarcia PrincessFartin Prince (by Bart Simpson)Martin the Brown-Nosed ReindeerMiltonQueen of Summer TimeKing of Summer Time",
    "hair": "Blond",
    "occupation": "Student at Springfield Elementary School",
    "relatives": "Father: Martin Prince Sr.Mother: Martha PrinceGrandmother: Unnamed",
    "first_appearance": "\"Bart the Genius\"",
    "voiced_by": "Russi Taylor (Season 1-Season 31)  Grey DeLisle (Season 31- Present) Jo Ann Harris[1]Michael Jackson (\"Do the Bartman\")Nancy Cartwright[2]Pamela Hayden[3]Dan Castellaneta[4]",
    "name": "Martin Prince"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Grey (brown)",
    "occupation": "Stock Broker",
    "relatives": "Wife: Martha PrinceSon: Martin Prince",
    "first_appearance": "Bart the Genius",
    "voiced_by": "Dan Castellaneta",
    "name": "Martin Prince, Sr."
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Gray-Brown (formerly)Gray (currently)",
    "occupation": "Principal of Springfield High School",
    "relatives": "Wife: Unnamed (deceased)",
    "first_appearance": "\"The Way We Was\"",
    "voiced_by": "Harry Shearer",
    "name": "Principal Dondelinger"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Blue",
    "occupation": "School District Psychologist",
    "first_appearance": "\"Bart the Genius\"",
    "voiced_by": "Harry Shearer",
    "name": "J. Loren Pryor"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Bald",
    "occupation": "Enforcer on Krusty's show",
    "first_appearance": "\"Itchy & Scratchy & Marge\"",
    "name": "Corporal Punishment"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "Channel 6 helicopter reporter",
    "relatives": "Ex[1]-wife: UnnamedSon: Unnamed",
    "first_appearance": "\"Some Enchanted Evening\" (voice only) (called Bill)\"Homer Alone\" (in person)",
    "voiced_by": "Dan Castellaneta",
    "name": "Arnie Pye"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Blond",
    "occupation": "American Gladiator",
    "relatives": "Ex-Girlfriend: Luann",
    "first_appearance": "\"A Milhouse Divided\"",
    "voiced_by": "Hank Azaria",
    "name": "Pyro"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "Press Secretary",
    "relatives": "Father: Clovis Quimby Mother: Rochelle  Possible sister: Mayor Quimby's niece  Uncle: Mayor Quimby  Aunt: Martha Quimby  Grandmother: Rose Quimby Relative: Maria QuimbyNumerous half-cousins",
    "first_appearance": "\"The Boy Who Knew Too Much\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Freddy Quimby"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "Mayor QuimbyDiamond Joe",
    "hair": "Brown",
    "occupation": "Mayor of Springfield",
    "relatives": "Parents: Joe Quimby, Sr. and Rose QuimbyWife: Martha QuimbyMistress: Miss SpringfieldEx-mistress: Cookie KwanNiece/mistress: UnnamedBrother: Clovis QuimbyNephew: Freddy QuimbyChildren: 2 sons and daughter Unnamed sonJoey QuimbyUnnamed daughter[1]Many illegitimate sons",
    "first_appearance": "\"Bart Gets an \"F\"\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Joe Quimby"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Black",
    "occupation": "La Maison Derrière (Former)",
    "relatives": "Husband: Joe Quimby  Nephew: Freddy Quimby  Brother-In Law: Clovis Quimby  Son: Joey Quimby",
    "first_appearance": "\"Bart Gets Famous\"",
    "voiced_by": "Maggie Roswell",
    "name": "Martha Quimby"
  },
  {
    "sex": "Male",
    "status": "Fictional",
    "alias(es)": "Claude Kane III",
    "first_appearance": "\"Bart the Genius\"",
    "voiced_by": "Harry Shearer",
    "name": "Radioactive Man (character)"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Bald",
    "occupation": "Various",
    "first_appearance": "\"The Way We Was\"",
    "voiced_by": "Hank Azaria",
    "name": "Raphael"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "The Mad Russian",
    "hair": "Red",
    "occupation": "Professional wrestler",
    "location": "Russia/Springfield",
    "first_appearance": "\"Bart the Daredevil\"",
    "name": "Rasputin the Friendly Russian"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "Replacement Chief of PoliceUnited States Treasury Agent",
    "first_appearance": "\"Homer vs. the Eighteenth Amendment\"",
    "voiced_by": "Dave Thomas",
    "name": "Rex Banner"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Ginger",
    "occupation": "Student at Springfield Elementary School",
    "relatives": "Mother: Mrs. Rhenquist Father: Mr. Rhenquist",
    "first_appearance": "\"Bye Bye Nerdie\"",
    "voiced_by": "Kathy Griffin",
    "name": "Francine Rhenquist"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "Senator Shady Bird Johnson",
    "hair": "White",
    "occupation": "Business OwnerFormer Senator",
    "relatives": "Daughter: Paris TexanGrandson: Unnamed",
    "first_appearance": "\"$pringfield (Or, How I Learned to Stop Worrying and Love Legalized Gambling)\"",
    "voiced_by": "Dan Castellaneta",
    "name": "The Rich Texan"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Gray (sometimes light blue)",
    "occupation": "Student",
    "relatives": "Grandfather: Unnamed[1] Mother Richard's MotherFather: Unnamed",
    "first_appearance": "\"Bart the Genius\"",
    "voiced_by": "Jo Ann Harris  Nancy Cartwright  Pamela Hayden  Maggie Roswell",
    "name": "Richard"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown",
    "first_appearance": "\"The Itchy & Scratchy & Poochie Show\"",
    "voiced_by": "Hank Azaria",
    "name": "Roy"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Black, Almost Bald. sometimes grey",
    "occupation": "Chef, Hollywood's foreign press",
    "first_appearance": "\"Sweet Seymour Skinner's Baadasssss Song\"",
    "voiced_by": "Hank Azaria",
    "name": "Luigi Risotto"
  },
  {
    "sex": "Male",
    "status": "Revived",
    "hair": "Black",
    "occupation": "Doctor",
    "first_appearance": "\"Bart Gets Hit by a Car\"",
    "voiced_by": "Hank Azaria",
    "name": "Nick Riviera"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Gray",
    "occupation": "Head of the EPA (Formerly)Evil Mastermind",
    "first_appearance": "The Simpsons Movie",
    "voiced_by": "Albert Brooks",
    "name": "Russ Cargill"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Gray",
    "occupation": "Target store employee[1]",
    "relatives": "Wife: Unnamed",
    "first_appearance": "Simpsons Roasting on an Open Fire",
    "voiced_by": "Hank Azaria",
    "name": "Sam (barfly)"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "GeraldBaby GeraldThe Monobrow BabyThe Unibrow BabyGerald Samson",
    "hair": "Black unibrow, blond single curlBrown (in the future)",
    "relatives": "Mother: Mrs. SamsonFather: Mr. Samson",
    "first_appearance": "\"Sweet Seymour Skinner's Baadasssss Song\"",
    "voiced_by": "Hank Azaria",
    "name": "Gerald Samson"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Brown",
    "relatives": "Husband: Mr. SamsonSon: Gerald Samson",
    "first_appearance": "\"The Canine Mutiny\"",
    "voiced_by": "Maggie Roswell",
    "name": "Ms. Samson"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Red",
    "occupation": "Owner of Globex CorporationPhilanthropistSupervillain",
    "relatives": "Son: Freddie Scorpio",
    "first_appearance": "\"You Only Move Twice\"",
    "voiced_by": "Albert Brooks",
    "name": "Hank Scorpio"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Reddish brown",
    "occupation": "President of the United States",
    "relatives": "Possible Brother Rainier Wolfcastle",
    "first_appearance": "The Simpsons Movie",
    "voiced_by": "Harry Shearer",
    "name": "Arnold Schwarzenegger"
  },
  {
    "species": "Cat",
    "gender": "Male",
    "status": "Fictional",
    "color": "Black",
    "owner": "Roger Meyers, Jr.",
    "relatives": "Wife: Mrs. ScratchySon: Scratchy Jr.Sister: Lady Scratchy",
    "first_appearance": "\"The Bart Simpson Show\"",
    "voiced_by": "Dan CastellanetaHarry Shearer",
    "name": "Scratchy"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "occupation": "Preparer",
    "first_appearance": "\"Treehouse of Horror\"",
    "voiced_by": "James Earl Jones",
    "name": "Serak the Preparer"
  },
  {
    "sex": "Female",
    "status": "Fictional",
    "hair": "Brown",
    "occupation": "Nanny for The Simpson family (Former)",
    "relatives": "Ex-fiancé: William MacDougal",
    "first_appearance": "Simpsoncalifragilisticexpiala(Annoyed Grunt)cious",
    "voiced_by": "Maggie Roswell",
    "name": "Shary Bobbins"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "Manager at Smart TykesKrusty Burger employee (formerly)",
    "relatives": "Father: Gary Chalmers  Mother: Rosemary Chalmers Aunt: Muriel Chalmers",
    "first_appearance": "\"The Good, the Sad and the Drugly\"",
    "voiced_by": "Tress MacNeille",
    "name": "Shauna Chalmers"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Blond",
    "relatives": "Father: Unnamed",
    "first_appearance": "\"Lemon of Troy\"",
    "voiced_by": "Tress MacNeille",
    "name": "Shelby"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Purple",
    "occupation": "Student",
    "relatives": "Mother: Jerri Mackleberry[1]Father: Mr. MackleberrySisters: Terri Mackleberry and Unnamed Brother: Larry MackleberryBrother:  Jerry Mackleberry Great-aunt: Unnamed Cousin: UnnamedGrandmother: Unnamed[2]Husband (future): Nelson Muntz (possibly)Children (future): Nelson Jr. (Possibly) and two unnamed",
    "first_appearance": "\"Simpsons Roasting on an Open Fire\"",
    "voiced_by": "Russi Taylor (Season 1-Season 30)  Grey Delisle (Season 31- Present)",
    "name": "Sherri Mackleberry"
  },
  {
    "sex": "Male",
    "hair": "Black",
    "occupation": "Critic",
    "relatives": "Parents: Franklin and Eleanor Sherman Siblings: Margo Sherman Sons: Martin Sherman Ex-wives: Ardeth Sherman Girlfriends: Alice Tompkins",
    "first_appearance": "\"A Star is Burns\"",
    "voiced_by": "Jon LovitzMaurice LaMarche (belch)",
    "name": "Jay Sherman"
  },
  {
    "sex": "Male",
    "hair": "Blue",
    "occupation": "Investigative journalist",
    "first_appearance": "\"Two Cars in Every Garage and Three Eyes on Every Fish\"",
    "voiced_by": "Harry Shearer",
    "name": "Dave Shutton"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Ginger",
    "occupation": "Employee at SNPP (Fired)",
    "first_appearance": "\"The Last Temptation of Homer\"",
    "voiced_by": "Michelle Pfeiffer",
    "name": "Mindy Simmons"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "alias(es)": "Ag",
    "hair": "Gray (wig)Brown (formerly)",
    "occupation": "Wing Walker (previously)Receptionist at City Intern Applications (previously)RetiredOlympic Pole Vaulter",
    "relatives": "Father: MarkMother: EllenHusband: Sheldon Skinner (deceased)Brother: Stevie SkinnerSon: Seymour SkinnerReal Son: Seymour Skinner (real) (non-canon)Marital Nephew: Headmaster SkinnedwienerBoyfriends: Comic Book Guy and Gary Chalmers",
    "first_appearance": "The Crepes of Wrath",
    "voiced_by": "Tress MacNeille",
    "name": "Agnes Skinner"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Black",
    "occupation": "Stage Director  Waiter",
    "relatives": "Sister: Ms. Sinclair",
    "first_appearance": "\"A Streetcar Named Marge\"",
    "voiced_by": "Jon Lovitz",
    "name": "Llewellyn Sinclair"
  },
  {
    "sex": "Male",
    "status": "Fictional",
    "occupation": "Film Strip Commentator",
    "first_appearance": "Homer's Odyssey",
    "voiced_by": "Harry Shearer",
    "name": "Smilin' Joe Fission"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "Chuckles (By Larry Burns)",
    "hair": "Gray/tanBlue (originally)",
    "occupation": "Assistant to Mr. Burns",
    "relatives": "Father: Waylon Smithers, Sr. (deceased)Mother: Mrs. SmithersAdopted Father/Guardian: Mr. BurnsEx-wife: UnnamedGrandmother: Unnamed (deceased)[1]Cousin: Mr. Smitters Ex-girlfriend: Selma BouvierEx-boyfriend: JohnEx-boyfriend: Julio",
    "first_appearance": "\"Simpsons Roasting on an Open Fire\" (voice only)\"Homer's Odyssey\" (in person)",
    "voiced_by": "Harry ShearerHiroshi Iuchi (The Simpsons Arcade Game)",
    "name": "Waylon Smithers, Jr."
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "Fatty Boomalatty (By his sister)",
    "hair": "Black",
    "occupation": "Judge",
    "relatives": "Unknown sonUnknown ex-wifeUnknown sister",
    "first_appearance": "\"Krusty Gets Busted\"",
    "voiced_by": "Harry ShearerDan Castellaneta (Krusty Gets Busted)",
    "name": "Roy Snyder"
  },
  {
    "sex": "None",
    "status": "Destroyed",
    "hair": "None",
    "occupation": "Robot for disarming bombs",
    "first_appearance": "The Simpsons Movie",
    "voiced_by": "Hank Azaria",
    "name": "Bomb Disarming Robot"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "alias(es)": "Hans Sprungfeld",
    "hair": "Brown",
    "occupation": "Founder of SpringfieldPirateMurderer",
    "relatives": "Father: Mr. SprungfeldMother: Mrs. SprungfeldSiblings: 16 unnamedChildren: Obadiah and Zechariah Springfield and an unnamed daughterGreat Grandson: Jebediah Springfield IV",
    "first_appearance": "\"The Telltale Head\"",
    "voiced_by": "Harry Shearer",
    "name": "Jebediah Springfield"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Blonde",
    "occupation": "Miss Springfield",
    "relatives": "Secret lover: Mayor Quimby  Children (with Mayor Quimby): Three unnamed",
    "first_appearance": "\"Whacking Day\"",
    "voiced_by": "Tress MacNeille",
    "name": "Miss Springfield"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Red (Ginger)",
    "occupation": "Farmer, Housewife, Dairy Queen Employee, and Soldier in Iraq War",
    "relatives": "Husband: Cletus SpucklerChildren: Spuckler children",
    "first_appearance": "\"22 Short Films About Springfield\"",
    "voiced_by": "Tress MacNeille,  Neil Crone (male voice)",
    "name": "Brandine Spuckler"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brownish",
    "occupation": "FarmerConstruction workerUSMC operativePaparazzo",
    "relatives": "Wife/Sister: BrandineMother: MawFather: Pete SpucklerCousins:MerlDia-BettyHalf-brother: UnnamedChildren: Gummy SueNormal Head JoeTiffanyDesignated DorothyHeatherCodyDylanDermottJordanTaylorBrittanyWesleyRumerScoutCassidyZoeChloeMaxHunterRubella ScabiesKendallNoahSaschaMorganKyraIanLaurenQ-BertPhilBirthdayCrystal MethDubyaIncestInternational HarvesterJitneyWhitneyMaryStabbed in JailWheel and BarrelTripodNavel StringMelvisMary Not-Quite-RightMary ZekeEmbry JoeKatlinGitmo\"Something New\"UnnamedUnnamedUnnamedUnnamedUnnamedUnnamed",
    "first_appearance": "Bart Gets an Elephant",
    "voiced_by": "Hank Azaria",
    "name": "Cletus Spuckler"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Light Brown",
    "relatives": "Father: Cletus Spuckler  Mother: Brandine Spuckler  Siblings: Spuckler children  Ex-fiancé: Bart Simpson",
    "first_appearance": "\"Apocalypse Cow\"",
    "voiced_by": "Zooey Deschanel",
    "name": "Mary Spuckler"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Red (sometimes brown)",
    "occupation": "School bully",
    "relatives": "Father: Mr. StarbeamMother: Starla StarbeamSister: Unnamed",
    "first_appearance": "\"The Telltale Head\"",
    "voiced_by": "Tress MacNeillePamela Hayden (The Telltale Head, When Flanders Failed, New Kid on the Block, The PTA Disbands, and The Boys of Bummer)",
    "name": "Dolph Starbeam"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Gray",
    "occupation": "Boxing manager",
    "first_appearance": "\"Homer vs. Lisa and the 8th Commandment\"",
    "voiced_by": "Paul Winfield",
    "name": "Lucius Sweet"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Black",
    "occupation": "Celebrity boxer",
    "relatives": "Wife: Unnamed[1]Children: Unnamed[2]Mother: Unnamed",
    "first_appearance": "\"Homer vs. Lisa and the 8th Commandment\"",
    "voiced_by": "Hank Azaria",
    "name": "Drederick Tatum"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Auburn",
    "occupation": "Student",
    "relatives": "Father: Mr. TaylorMother: Annette Taylor",
    "first_appearance": "\"Lisa's Rival\"",
    "voiced_by": "Winona RyderPamela Hayden",
    "name": "Allison Taylor"
  },
  {
    "gender": "Male",
    "status": "Alive",
    "color": "Brown",
    "owner": "Krusty the Clown",
    "relatives": "Father: Daddy TeenyMother: Toot-TootUncle: UnnamedSiblings: All unnamed",
    "first_appearance": "\"Itchy & Scratchy & Marge\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Mr. Teeny"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Purple",
    "occupation": "Student",
    "relatives": "Mother: Jerri MackleberryFather: Mr. MackleberrySisters: Sherri Mackleberry and UnnamedCousin: UnnamedGrandmother: UnnamedBrother: Larry MackleberryBrother:  Jerry Mackleberry Great-aunt: Unnamed",
    "first_appearance": "\"Simpsons Roasting on an Open Fire\"",
    "voiced_by": "Russi Taylor (Season 1-Season 30)  Grey Delisle (Season 31- Present)",
    "name": "Terri Mackleberry"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Light Orange",
    "occupation": "Criminal MastermindChief Hydrological and Hydrodynamical EngineerMusic Friendship Employee",
    "relatives": "Brother: Robert TerwilligerFather: Robert Terwilliger Sr.Mother: Dame Judith UnderdunkSister-in-law: Francesca TerwilligerWife: Unknown Son: Neil TerwilligerNephew: Gino TerwilligerCousin: Bobby Terwilliger",
    "first_appearance": "\"Brother from Another Series\"",
    "voiced_by": "David Hyde Pierce",
    "name": "Cecil Terwilliger"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Black",
    "occupation": "CriminalHousewife",
    "relatives": "Husband: Robert TerwilligerSon: Gino TerwilligerFather-in-Law: Robert Terwilliger Sr.Mother-in-Law: Dame Judith UnderdunkBrother-in-Law: Cecil TerwilligerCousin-in-Law: Bobby TerwilligerMarital Nephew: Neil Terwilliger",
    "first_appearance": "\"The Italian Bob\"",
    "voiced_by": "Maria Grazia CucinottaTress MacNeille (KABF01)",
    "name": "Francesca Terwilliger"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Reddish Brown",
    "occupation": "Child Murderer",
    "relatives": "Grandfather: Robert Terwilliger Sr.Grandmother: Dame Judith UnderdunkFather: Robert TerwilligerMother: Francesca TerwilligerUncles: Cecil and Bobby TerwilligerCousin: Neil Terwilliger",
    "first_appearance": "\"The Italian Bob\"",
    "voiced_by": "Tress MacNeille",
    "name": "Gino Terwilliger"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "Goon",
    "hair": "Black",
    "occupation": "Mafia associate",
    "relatives": "Grandmother: UnnamedMother: Unnamed",
    "first_appearance": "\"The Twisted World of Marge Simpson\"",
    "voiced_by": "Hank Azaria",
    "name": "Johnny Tightlips"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "Churchy (By Kirk)Noodle-Armed Choir Boy (By Willie)Padre (Multiple characters)",
    "hair": "Black (originally brown)",
    "occupation": "Reverend of the First Church of Springfield",
    "relatives": "Father: Timothy Lovejoy, Sr.Wife: Helen LovejoyDaughter: Jessica Lovejoy",
    "first_appearance": "\"The Telltale Head\"",
    "voiced_by": "Harry Shearer",
    "name": "Timothy Lovejoy, Jr."
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Pink/Brown/Blue",
    "occupation": "ActressDancer",
    "first_appearance": "\"Like Father, Like Clown\"",
    "name": "Tina Ballerina"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Blonde",
    "occupation": "Bartender at Juggernauts and Knockers",
    "first_appearance": "\"Pygmoelian\"",
    "voiced_by": "Pamela Hayden",
    "name": "Titania"
  },
  {
    "sex": "Male",
    "hair": "Black",
    "occupation": "Sushi Chef",
    "first_appearance": "\"One Fish, Two Fish, Blowfish, Blue Fish\"",
    "voiced_by": "Joey Miyashima",
    "name": "Toshiro"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "Wine MakerMayorLeather makerExpert on mustardPoetRobber",
    "relatives": "Uncle: Cesar",
    "first_appearance": "\"The Crepes of Wrath\"",
    "voiced_by": "Dan CastellanetaHarry Shearer (The Simpsons Game)",
    "name": "Ugolin"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Blue, balding",
    "occupation": "UnemployedFactory Worker (previous)Peanut Vendor (previous)",
    "relatives": "Son: Milhouse Van HoutenWife (cousin): Luann Van HoutenMother: Grandma Van HoutenFather: Grandpa Van HoutenBrother: Norbert Van HoutenNephew: Milquetoast Van HoutenNiece: Annika Van HoutenGreat-Great-Great-Great Grandparents: Milford Van Houten and Eliza SimpsonStepmother: Grandpa Van Houten's Second WifeMother-in-Law: Nana Sophie MussoliniFather-in-Law: Southern Cracker ManagerSister-in-Law: Luann's SisterHalf-Brother-in-Law: Bastardo Mussolini",
    "first_appearance": "\"Bart's Friend Falls in Love\"",
    "voiced_by": "Hank Azaria",
    "name": "Kirk Van Houten"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Black",
    "relatives": "Wife: Mrs. Vanderbilt",
    "first_appearance": "Saddlesore Galactica",
    "voiced_by": "Hank Azaria",
    "name": "Mr. Vanderbilt"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Grey",
    "relatives": "Husband: Mr. Vanderbilt",
    "first_appearance": "Saddlesore Galactica",
    "voiced_by": "Tress MacNeille",
    "name": "Mrs. Vanderbilt"
  },
  {
    "sex": "Male",
    "hair": "Black",
    "occupation": "Plastic surgeon",
    "first_appearance": "\"Pygmoelian\"",
    "voiced_by": "Hank Azaria",
    "name": "Dr. Velimirovic"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Black with purple highlights",
    "first_appearance": "\"The Wandering Juvie\"",
    "voiced_by": "Sarah Michelle Gellar",
    "name": "Gina Vendetti"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "Writer for The Itchy & Scratchy Show",
    "first_appearance": "\"22 Short Films About Springfield\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Ian (Very Tall Man)"
  },
  {
    "sex": "Male",
    "hair": "Black",
    "occupation": "Veterinarian, Doctor",
    "first_appearance": "\"Dog of Death\"",
    "voiced_by": "Hank Azaria",
    "name": "Veterinarian"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "Orphan",
    "relatives": "Mother: UnnamedBrother: Patches",
    "first_appearance": "\"Miracle on Evergreen Terrace\"",
    "voiced_by": "Tress MacNeille",
    "name": "Poor Violet"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "White",
    "occupation": "Mob boss",
    "relatives": "Son: UnnamedBrother: Unknown",
    "first_appearance": "“Homie the Clown”",
    "voiced_by": "Hank Azaria",
    "name": "Don Vittorio DiMaggio"
  },
  {
    "sex": "Male",
    "hair": "Gray",
    "occupation": "Warden",
    "first_appearance": "\"Hurricane Neddy\"",
    "voiced_by": "Charles Napier",
    "name": "The Warden"
  },
  {
    "sex": "Male",
    "occupation": "Professional wrestler",
    "first_appearance": "\"Bart the Daredevil\"",
    "name": "Professor Werner von Brawn"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Blonde",
    "occupation": "Student at Springfield Elementary School",
    "first_appearance": "\"Lard of the Dance\"",
    "voiced_by": "Lisa Kudrow",
    "name": "Alex Whitney"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Red, balding",
    "occupation": "Groundskeeper and Janitor at Springfield Elementary School",
    "relatives": "Parents: Mr. and Mrs. MacDougalBrother: Angus MacDougalCousin: Billy MacDougalEx-girlfriend: Patty BouvierEx-fiancée: Shary BobbinsImaginary Lover: UnnamedGirlfriend: Inga",
    "first_appearance": "\"Principal Charming\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Groundskeeper Willie"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "Chief WiggumChiefSky PoliceDaddy Round-RoundChief Piggum",
    "hair": "Blue, originally black",
    "occupation": "Police chief",
    "relatives": "Wife: Sarah WiggumSon: Ralph WiggumFather: Iggy WiggumMother: Mrs WiggumBrother: UnnamedBrother-in-law: Fred KannekeSister: Lucy WiggumCousin: Mark Wiggum",
    "first_appearance": "\"Homer's Odyssey\"",
    "voiced_by": "Hank AzariaShelby Grimm (singing as a \"The Be Sharps\")",
    "name": "Clancy Wiggum"
  },
  {
    "sex": "Male",
    "status": "Revived",
    "hair": "Several strandsBlue (some future episodes)Brown (\"Bart to the Future\")",
    "occupation": "Student at Springfield Elementary School Singer for Party Posse (formerly)Presidential Candidate",
    "relatives": "Parents: Clancy Wiggum and Sarah WiggumGrandfather: Iggy Wiggum:Grandmother: Mrs WiggumUncles: Fred Kanneke and Clancy Wiggum's brotherAunt: Lucy WiggumFirst Cousin Once Removed: Mark Wiggum",
    "first_appearance": "\"Simpsons Roasting on an Open Fire\"",
    "voiced_by": "Nancy CartwrightBen Bledsoe (\"New Kids on the Blecch\")Pamela Hayden (\"Simpsons Roasting on an Open Fire\")",
    "name": "Ralph Wiggum"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Bluish-purple",
    "occupation": "Housewife",
    "relatives": "Husband: Clancy WiggumSon: Ralph WiggumBrother: Fred KannekeFather in Law: Iggy Wiggum (deceased)",
    "first_appearance": "\"Duffless\"",
    "voiced_by": "Pamela Hayden",
    "name": "Sarah Wiggum"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "White",
    "occupation": "Retired Aviator",
    "relatives": "Wife: Sylvia Winfield",
    "first_appearance": "\"Homer's Odyssey\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Mr. Winfield"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "White",
    "occupation": "Retired",
    "relatives": "Husband: Mr. Winfield",
    "first_appearance": "\"Homer's Odyssey\"",
    "voiced_by": "Tracey UllmanMaggie Roswell",
    "name": "Sylvia Winfield"
  },
  {
    "sex": "Female",
    "hair": "Orange",
    "occupation": "Dog Trainer",
    "first_appearance": "\"Bart's Dog Gets an F\"",
    "voiced_by": "Tracey Ullman",
    "name": "Emily Winthrop"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Blonde",
    "relatives": "Father: Rainier WolfcastleMother: Maria WolfcastleEx-boyfriends: Milhouse Van Houten and Bart Simpson",
    "first_appearance": "\"The Bart Wants What It Wants\"",
    "voiced_by": "Reese Witherspoon",
    "name": "Greta Wolfcastle"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Blonde",
    "occupation": "Actor",
    "relatives": "Ex-wife: Maria QuimbyDaughter: Greta WolfcastlePossible Brother: Arnold Schwarzenegger",
    "first_appearance": "\"The Way We Was\"",
    "voiced_by": "Harry ShearerHank Azaria (younger; \"Simpsoncalifragilisticexpiala(Annoyed Grunt)cious\")",
    "name": "Rainier Wolfcastle"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Gray",
    "occupation": "Healer  Therapist  Eskimo",
    "first_appearance": "The Simpsons Movie",
    "voiced_by": "Tress MacNeille",
    "name": "Medicine Woman"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Black",
    "occupation": "Student",
    "first_appearance": "\"Bart the General\"",
    "voiced_by": "Nancy Cartwright (currently)Susan Blu (formerly)",
    "name": "Yellow Weasel"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "Various",
    "first_appearance": "\"Mayored to the Mob\"",
    "voiced_by": "Dan Castellaneta",
    "name": "The Yes Guy"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Black",
    "occupation": "Software billionaire (former)  Owner of Ziffcorp (former)",
    "relatives": "Ex-girlfriends: Marge SimpsonSelma Bouvier ",
    "first_appearance": "\"The Way We Was\"",
    "voiced_by": "Jon LovitzDan Castellaneta (\"The Front\")",
    "name": "Artie Ziff"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "Ooter",
    "hair": "Light Blond",
    "occupation": "Student at Springfield Elementary School",
    "location": "Germany (Where He Mainly Lives)Springfield (Sometimes)",
    "relatives": "Father: Mr. ZörkerMother: Mrs. ZörkerUncle:  Üter's Uncle Rewrited",
    "first_appearance": "\"Treehouse of Horror IV\" (non-canon)\"Lisa's Rival\" (canon)",
    "voiced_by": "Russi Taylor (Season 5 - Season 30)Grey DeLisle (Season 31 - present)",
    "name": "Üter Zörker"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Bald, because his hair got shaved off",
    "occupation": "School student",
    "relatives": "Sons: Kearney Zzyzwicz, Jr. and UnnamedFather: Mr. ZzyzwiczEx-wife: UnnamedMother: Mrs. Zzyzwicz",
    "first_appearance": "\"The Telltale Head\"",
    "voiced_by": "Nancy CartwrightPamela Hayden (\"The PTA Disbands\")",
    "name": "Kearney Zzyzwicz"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Buzz cut",
    "relatives": "Father: Kearney Zzyzwicz Mother: UnnamedPaternal Grandfather: Mr. ZzyzwiczPaternal Grandmother: Mrs. ZzyzwiczBrother: Kearney's unnamed sonSons: Kearney Zzyzwicz III (non-canon)",
    "first_appearance": "\"Mr. Lisa Goes to Washington\"",
    "voiced_by": "Nancy Cartwright",
    "name": "Kearney Zzyzwicz, Jr."
  },
  {
    "sex": "Male",
    "hair": "None",
    "occupation": "Homer's alter ego",
    "relatives": "Good Homer, Alter Homer",
    "first_appearance": "\"Whacking Day\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Evil Homer"
  },
  {
    "sex": "Male",
    "other_statuses": "Deceased",
    "status": "Alive",
    "alias(es)": "DadHomer Thompson[1] Homer Samson[2]Brian McGeeKrusty the ClownCommander CoolSir Fix-A-LotPie ManMax Power[3]El HomoThad SuperspermBald Mommy[4]Rock Strongo[5]Lance Uppercut[5]Colonel Homer[6]Elvis Jagger Abdul - Jabbar [7]Dancin' Homer[8]Angry DadCaptain WackyGeraldo Simpson[9]Admiral AwesomeMr. BurnsMrs. Burns[10]Chad SexingtonCaptain CrazyLance RomanceMr. PlowAutomobile Von BismarckThe Immovable Object[11]The Brick Hithouse[11]The Southern Dandy[11]King-Size HomerHome BoyHome DudeInternet KingDr. TunaTyranosaurus sexHappy DudeHomie (by Marge)Mr. X (anonymously)Homer Finger Hands [12]Fish Bulb [13]Springfield (by Shelby's Father)Peter Pantless",
    "hair": "BaldBrown (formerly)",
    "occupation": "Currently: Nuclear Safety InspectorNuclear Technician (formerly)Other Jobs: (see List of Homer's jobs)",
    "location": "Springfield, Springfield's State",
    "relatives": "Parents: Abraham Simpson and Mona SimpsonWife: Marge BouvierEx-Wife: Amber SimpsonStepmother: Rita LaFleurChildren: Bart Simpson, Lisa Simpson and Maggie SimpsonUncles: Hubert Simpson, Tyrone Simpson, Chet Simpson, Cyrus Simpson, Bill SimpsonAunt: Hortense SimpsonMarital Aunts: Cyrus' 15 wives  Kari Olsen Cousins: Frank Simpson, Valerie Rothman, Omar Simpson, and Dr. SimpsonHalf-Brother: Herbert PowellHalf-Sister: Abbie SimpsonThird Cousin Once Removed: Simon SimpsonGrandfathers: Orville Simpson and Bjorn OlsenGrandmothers: Yuma Hickman and Linnea PenelopeSisters-in-Law: Patty Bouvier and Selma BouvierFather-in-Law: Clancy BouvierMother-in-Law: Jacqueline GurneyCousin-in-law: Marnie SimpsonNephew: Brit SimpsonNieces: Lily and Magpie SimpsonAdoptive Marital Niece: Ling BouvierSee Simpson family",
    "first_appearance": "\"Good Night\"",
    "voiced_by": "Dan CastellanetaDon Jordan (singing voice; \"Homer's Barbershop Quartet\")Harry Shearer (nose whistling; \"Homer Loves Flanders\")John Ratzenberger (\"Treehouse of Horror XXV\")",
    "name": "Homer Simpson"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "alias(es)": "MomMrs. Simpson[1]Midge[2]Major MargeMarge Bouvier",
    "hair": "Blue, naturally grey",
    "occupation": "Housewife",
    "location": "742 Evergreen Terrace, Springfield, Springfield's State",
    "relatives": "Parents: Clancy Bouvier and Jacqueline BouvierSisters: Patty and Selma BouvierHusband: Homer SimpsonChildren: Bart Simpson, Lisa Simpson and Maggie SimpsonFather-in-Law: Abraham SimpsonMother-in-Law: Mona SimpsonHalf-Brother-in-Law: Herbert PowellHalf-Sister-in-Law: Abbie SimpsonCousin-in-Law: Omar SimpsonNephew: Brit SimpsonNieces: Lily and Magpie SimpsonAdoptive Niece: Ling BouvierGrandfathers: Pépé Bouvier and Ferdinand GurneyGrandmothers: Bambi Bouvier and Alvarine BisqueEx-Brothers-in-Law: Sideshow Bob, Lionel Hutz, Troy McClure, Disco Stu and Fit TonyUncles: Chester Bouvier, Arthur Bouvier, Herman Bouvier, JoJo Bouvier and Lou GurneyAunts: Charlene Bouvier and Gladys GurneyMarital Aunt: Alfreda LeDouxCousins: Pierre Bouvier, Alfreda Bouvier II, Dorothé Bouvier, Rowena Bouvier, Tootsie Bouvier, Marnie Simpson, and Dot Gurney Great Grandfather Great Grandpa Bouvier",
    "first_appearance": "\"Good Night\"",
    "voiced_by": "Julie Kavner",
    "name": "Marge Simpson"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "BartmanEl BartoCupcake KidThe \"I Didn't Do It\" BoyEdith KnickertwistBartronBaby Stink Breath[1]Cosmos[2]RustyBart-Dude (by Otto Mann)Bart BartTimmy O' TooleThe Thing From UranusBeautiful BartLaddie LibertyCal A. BungaEarring BoySpecial Little Guy (By Marge)The Great Bart-oNaked Fairy Godboy [3]Bart FlandersDr. Ima ButtfaceThe Boy (by Homer)Ratboy (by Homer)Shoes Butt-back[4]",
    "hair": "Blonde",
    "occupation": "Student at Springfield Elementary School",
    "location": "Springfield",
    "relatives": "Father: Homer SimpsonMother: Marge SimpsonTwin Brother: Hugo Simpson II (non-canon)Sisters: Lisa Simpson and Maggie SimpsonGrandfathers: Abraham Simpson and Clancy Bouvier Grandmothers: Mona Simpson and Jacqueline BouvierUncle: Omar SimpsonAunts: Marnie Simpson, Patty Bouvier, and Selma BouvierCousins: Brit, Lily, and Magpie SimpsonHalf-Uncle: Herbert PowellHalf-Aunt: AbbieAdoptive Cousin: Ling Bouvier",
    "first_appearance": "\"Good Night\"",
    "voiced_by": "Nancy CartwrightSteve Allen (Electronically altered voice)Daniel Stern (Adult Bart, narrator \"Three Men and a Comic Book\")",
    "name": "Bart Simpson"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "alias(es)": "Jake Boyman[1]Truth TellerLie SmellerLady Penelope Ariel Ponyweather[2] Lisa Bouvier (briefly)Raven Crow NeversmilesBig Maggie[3] [4] [5] Princess HelveticaSister Suspect [6]Lisa Flanders Moaning LisaMary-Anne [7]",
    "hair": "Blonde",
    "occupation": "Student at Springfield Elementary School, CTU Agent, Hall-monitorFormer: Babysitter Founder of SpringFace Kids News anchor",
    "relatives": "Father: Homer SimpsonMother: Marge SimpsonBrother: Bart SimpsonSister: Maggie SimpsonHalf-Uncle: Herbert PowellUncle: Omar SimpsonAunts: Patty, Selma Bouvier, and Marnie SimpsonHalf-Aunt: AbbieCousins: Brit, Lily, and Magpie SimpsonAdoptive Cousin: Ling BouvierGrandfathers: Abraham Simpson and Clancy BouvierGrandmothers: Mona Simpson and Jacqueline Bouvier",
    "first_appearance": "\"Good Night\"",
    "voiced_by": "Yeardley Smith",
    "name": "Lisa Simpson"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "alias(es)": "The BabyBaby BartI'm a Stupid Baby (Bart's note in \"Home Sweet Homediddly-Dum-Doodily\" originally placed on Lisa's back)Lisa (in the Tracey Ullman Short when Homer confuses Lisa and Maggie due to their hair genes)Outlands Maggie [1]",
    "hair": "Blonde",
    "relatives": "Father: Homer SimpsonMother:  Marge SimpsonBrother: Bart SimpsonSister: Lisa Simpson Half-Uncle: Herbert PowellHalf-Aunt: AbbieUncle: Omar SimpsonAunts: Marnie Simpson, Patty Bouvier, and Selma BouvierCousins: Brit Simpson, Lily Simpson, and Magpie SimpsonAdoptive Cousin: Ling BouvierGrandfathers: Abraham Simpson and Clancy BouvierGrandmothers: Mona Simpson and Jacqueline BouvierMother Kang (Non Conon)",
    "first_appearance": "\"Good Night\"",
    "voiced_by": "Nancy Cartwright (Currently)Yeardley Smith (Formerly)Danny DeVito (\"Brother, Can You Spare Two Dimes?\")Elizabeth Taylor (\"Lisa's First Word\")Jodie Foster (\"Four Great Women and a Manicure\")Harry Shearer (\"Treehouse of Horror IX\"; \"Treehouse of Horror X\")James Earl Jones (\"Treehouse of Horror V\")Kevin Michael Richardson (\"Treehouse of Horror XXVIII\")Matt Groening (pacifier)Liz Georges (The Tracey Ullman Show)Gábor Csupó (pacifier; formerly)",
    "name": "Maggie Simpson"
  },
  {
    "sex": "Male",
    "other_statuses": "...",
    "status": "Alive",
    "alias(es)": "AbeGrampa SimpsonGrampaLove TesterGorgeous GodfreyLil' Grampa SimpsonYoung Grampa Simpson Abraham Jay SimpsonAbe Simpson llAbe SimpsonAbraham Simpson",
    "hair": "Blondish, formerly brown and grey",
    "occupation": "RetiredPresident of the Springfield Gay & Lesbian AllianceSpringfield Communist Party memberWorld War II VeteranFlying Hellfish memberOwner of Simpson Laser Tag (formerly)Night Watchman at Cranberry Silo (formerly)",
    "location": "Springfield Retirement Castle",
    "relatives": "Father: Orville SimpsonMother: Yuma HickmanBrothers: Bill Simpson, Cyrus Simpson , Chet Simpson, Tyrone Simpson, Hubert Simpson, Fester SimpsonPossible sister/Possible aunt: Hortense SimpsonWives: Mona Simpson (deceased), Amber Simpson (deceased), Rita LaFleurEx-wives:  Selma Bouvier, Tallulah WinkelmanFather-in-law: Bjorn Olsen Mother-in-law: Linnea PenelopeEx-father-in-law: Clancy BouvierEx-mother-in-law: Jacqueline BouvierSons: Homer Simpson, Herbert PowellEx-adopted-step-daughter: Ling BouvierDaughter: Abbie SimpsonDaughter-in-law: Marge BouvierEx-daughter-in-law: Amber Simpson (deceased)Grandson: Bart SimpsonGranddaughters: Lisa SimpsonMaggie SimpsonSisters-in-law: Cyrus's 15 wivesPaternal grandfather: \"Old Tut\" SimpsonPaternal grandmother: \"Happy\" DinsdaleMaternal grandfather: Willard HickmanMaternal grandmother: Theodora HutshingGreat-grandfathers: Abraham Simpson IHoratio DinsdaleBertram HickmanGreat-grandmothers: Gabby CrouseEdwina ForayterNellie BalliwickGreat-great-grandparents: Virgil SimpsonMabel SimpsonAunts: Twitta SimpsonElrita SimpsonBonita SimpsonUncles: Boris SimpsonZeke HickmanGreat-uncles: Lou SimpsonHugo Simpson IUdell \"Spunky\" DinsdaleGreat-half-uncle: Gaston SimpsonGreat-half-aunt: Dulcine SimpsonGreat-grandaunt: Eliza SimpsonMarital great-granduncle: Milford Van HoutenNephews: Millionaire Actor, Omar Simpson, and Frank SimpsonNiece: Valerie RothmanNephew-in-law: Dave RothmanNiece-in-law: Marnie SimpsonGrandnephew: Brit SimpsonGrandnieces: Lily and Magpie SimpsonGreat-nephew: Stanley Simpson1st cousins once removed: Echardt SimpsonBob SimpsonTwyla SimpsonSecond cousins: Verna SimpsonVern SimpsonEchardt Simpson IILotus SimpsonFernice SchedeenIngrid SchedeenGreat Great Grandson: Moe Simpson",
    "first_appearance": "\"World War III\" (Photograph only) \"Grandpa & the Kids\" (First speaking appearance)",
    "voiced_by": "Dan Castellaneta",
    "name": "Abraham Simpson II"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "alias(es)": "Grandma Simpson, Mona Stevens, Martha Stewart, El Mono, Muddy Mae Suggins, Anita Bonghit, Mom, Sunny",
    "hair": "Gray, formerly maroon, dyed purple",
    "occupation": "Hippie and political activist (formerly)",
    "relatives": "Parents: Bjorn Olsen and Linnea PenelopeSister: Kari OlsenGrandfather: Jordan Olsen Grandmother: Linda Jones Husband: Abraham SimpsonSon: Homer SimpsonStepchildren: Herbert Powell and Abbie SimpsonDaughter-in-Law: Marge SimpsonGrandchildren: Bart Simpson, Lisa Simpson and Maggie SimpsonFather-in-Law: Orville SimpsonMother-in-Law: Yuma HickmanBrothers-in-Law: Bill Simpson, Chet Simpson, Tyrone Simpson, Cyrus Simpson and Hubert SimpsonSister-in-Law: Hortense SimpsonMarital Nephew: Frank SimpsonMarital Niece: Valerie RothmanMarital Nephew-in-Law: Dave RothmanMarital Great-Nephew: Stanley Simpson",
    "first_appearance": "\"Oh Brother, Where Art Thou?\"",
    "voiced_by": "Glenn CloseMaggie Roswell (formerly)Pamela Hayden (\"D'oh!\" in \"Mother Simpson\")Tress MacNeille (\"D'oh-in' in the Wind\")",
    "name": "Mona Simpson"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "\"Unky Herb\" (by Bart and Lisa)\"Herb\" (Homer)",
    "hair": "Brown",
    "occupation": "InventorBusinessman CEO of Powell Motors (formerly)",
    "relatives": "Biological Parents: Abraham Simpson and GabyStepmothers: Mona Simpson and Rita LaFleurAdoptive Parents: Edward Powell and Mililani OslerHalf-Siblings: Homer Simpson and AbbieAdoptive Siblings: Coco Powell, Wanda Powell and Carla PowellHalf-Sister-in-Law: Marge BouvierHalf-Nephew: Bart SimpsonHalf-Nieces: Lisa Simpson and Maggie SimpsonGrandparents: Orville Simpson and Yuma HickmanAunt: Hortense SimpsonUncles: Cyrus Simpson, Hubert Simpson, Tyrone Simpson, Chet Simpson and Bill Simpson",
    "first_appearance": "\"Oh Brother, Where Art Thou?\"",
    "voiced_by": "Danny DeVito",
    "name": "Herbert Powell"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Grey",
    "relatives": "Parents: Abraham Simpson and EdwinaHalf-Brothers: Herbert Powell and Homer SimpsonHalf-Sister-in-Law: Marge BouvierHalf-Nephew: Bart SimpsonHalf-Nieces: Lisa Simpson and Maggie SimpsonStepmothers: Mona Simpson and Rita LaFleurCousins: Frank Simpson and Valerie RothmanUncles: Cyrus Simpson, Bill Simpson, Chet Simpson, Hubert Simpson and Tyrone SimpsonAunt: Hortense SimpsonGrandparents: Orville Simpson and Yuma Hickman",
    "first_appearance": "\"The Regina Monologues\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Abbie Simpson"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Blonde",
    "relatives": "Father: Bart SimpsonMother: JendaStep-Father: JerryYounger Brother: Kirk SimpsonHalf-brother: Bart Jr.Paternal Grandparents: Homer and Marge Simpson Maternal Grandmother: Jenda's Mother Great Grandfathers: Abraham Simpson and Clancy BouvierGreat Grandmothers: Mona Simpson and Jacqueline BouvierParental Aunts: Lisa Simpson and Maggie SimpsonUncles by Marriage: Milhouse Van Houten, Gerald Samson (possibly)Paternal Cousins: Maggie Jr. and Zia Simpson",
    "first_appearance": "\"Holidays of Future Passed\"",
    "voiced_by": "Nancy Cartwright ",
    "name": "Picard Simpson"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Blonde",
    "relatives": "Father: Bart SimpsonMother: Jenda Step-father: JerryBrother: Picard SimpsonHalf-brother: Bart Jr.Grandmother: Marge SimpsonGrandfather:Homer SimpsonGreat Grandmothers:Jacqueline Bouvier and Mona Simpson Great-Grandfathers: Clancy Bouvier and Abraham Simpson  Uncles: Hugo Simpson (non-canon) and Milhouse Van HoutenAunts: Lisa Simpson, Maggie Simpson and a unnamed (non-canon)Cousins: Maggie Jr. and Zia Simpson  (See Simpson family)",
    "first_appearance": "\"Holidays of Future Passed\"",
    "voiced_by": "Pamela Hayden",
    "name": "Kirk Simpson"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Blonde",
    "occupation": "Beggar",
    "relatives": "Simpson family",
    "first_appearance": "\"Lisa the Simpson\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Beggar Relative"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "Fruit Bat ManHappy (one episode)Future BurnsOld Man BurnsMr. Burns (most common)Mean Man MontyBongo-head (one episode)Sir (mostly by Smithers)Burnsie (mainly by Lenny)M. Burns Monty  C.M. Burns  C. Montgomery Burns",
    "hair": "Gray, balding",
    "occupation": "SS officer (formerly)Owner of the Springfield Nuclear Power PlantPresident of the Springfield MonorailOwner of the Springfield Estadio de TorosWorld War II Veteran",
    "relatives": "Parental Grandfather/Adoptive father: Wainwright Montgomery BurnsPaternal grandmother: Evelyn GraycombMaternal Grandfather: Jean-Claude CharlesMaternal Grandmother: Ophelia CharlesFather: Clifford Burns Mother: Daphne CharlesSiblings: 11, including George Burns, Cornelius Burns, Cornelia Hernandez and Zeph BurnsGirlfriend: Maxine LombardSons: Larry BurnsWaylon Smithers, Jr. (foster son)Nieces: Pepita HernandezVictoria Burns-Vanderbilt-DuPont-Bush-RockeFeller-Symthe-Pitt-WhitneyAunt: Doreena BurnsCousins: Lyla and Mr. BumbleGrandchildren: UnnamedGreat-Grandfather: Franklin Jefferson Burns[1]Daughter-in-law: UnnamedFourth cousin: Abraham Simpson",
    "first_appearance": "\"Simpsons Roasting on an Open Fire\"",
    "voiced_by": "Christopher Collins (Early Season 1)Harry Shearer (Season 1-present)Nancy Cartwright (Angry Dad)M. Samejima (The Simpsons Arcade Game)",
    "name": "Charles Montgomery Burns"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "hair": "black",
    "relatives": "Husband: Joe Puffing Goat  Children: Winifred Running Goat, Jane Nervous Goat,  Humphrey Little Goat",
    "first_appearance": "The Simpsons Uncensored Family Album",
    "name": "Mary Frowning Cloud"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "relatives": "Parents: Horatio Dinsdale and  Edwina Forayter  Brother: Udell \"Spunky\" Dinsdale  Husband: \"Old Tut\" SimpsonChildren: Orville, Bonita, Elrita, Boris and Twitta Simpson  More relatives",
    "first_appearance": "The Simpsons Uncensored Family Album",
    "name": "\"Happy\" Dinsdale"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "relatives": "Parents: Howland Simpson and Gabby CrouseSiblings: \"Old Tut\" Simpson, Lou Simpson, Hugo Simpson I and Gaston Simpson",
    "first_appearance": "The Simpsons Uncensored Family Album",
    "name": "Dulcine Simpson"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "relatives": "Father: Lou SimpsonSons: Vern Simpson and Eckhardt Simpson II",
    "name": "Eckhardt Simpson"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "hair": "Blue",
    "relatives": "Husband: Abraham Simpson ISons: Lou Simpson, Hugo Simpson Sr., Gaston Simpson & \"Old Tut\" Simpson Daughter: Dulcine SimpsonFather-in-Law: Virgil SimpsonMother-in-Law: Mabel SimpsonHalf-Sister-in-Law: Eliza SimpsonDaughters-in-Law: \"Happy\" Dinsdale and Zorina OvadiaGrandchildren: Orville Simpson, Boris Simpson, Echardt Simpson, Bob Simpson, Bonita Simpson, Elrita Simpson, Twitta Simpson and Twyla SimpsonGranddaughter-in-Law: Yuma HickmanGreat-Grandson: Abraham Simpson",
    "first_appearance": "The Simpsons Uncensored Family Album",
    "name": "Gabby Crouse"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "hair": "Black",
    "relatives": "Husband: Rupert SimpsonChildren: Trixie, Prudence, Galston, Ivy and GarwoodBrother: Humphrey Little GoatSister: Jane Nervous GoatMother: Mary Frowning CloudFather: Joe Puffing GoatFather-in-law: Sven SimpsonMother-in-law: Claretta SimpsonGrandfather-in-law: Edward Simpson Sr.",
    "first_appearance": "The Simpsons Uncensored Family Album",
    "name": "Winifred Running Goat"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "hair": "Brown/Orange",
    "relatives": "Parents: Willard Hickman and Theodora HickmanBrother: Zeke HickmanHusband: Orville SimpsonBrother-in-Law: Boris SimpsonSisters-in-Law: Bonita Simpson, Elrita Simpson and Twitta SimpsonFather-in-Law: \"Old Tut\" SimpsonMother-in-Law: \"Happy\" DinsdaleGrandparents: Bertram Hickman and Nellie BalliwickSons: Hubert Simpson, Tyrone Simpson, Cyrus Simpson, Abraham Simpson, Bill Simpson and  Chet SimpsonDaughter: Hortense SimpsonDaughters-in-Law: Mona Simpson, Rita LaFleur and Cyrus's 15 wivesGrandchildren: Homer Simpson, Herbert Powell, Frank Simpson,Valerie Rothman, Abbie Simpson, and one unnamedGreat-Grandchildren: Bart Simpson Lisa Simpson and Maggie SimpsonGranddaughter-in-Law: Marge SimpsonGrandson-in-Law: Dave Rothman",
    "first_appearance": "Much Apu About Nothing",
    "voiced_by": "Tress MacNeille",
    "name": "Yuma Hickman"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "alias(es)": "Homer Simpson, El Homo the Thief",
    "hair": "Bald; brown beard",
    "occupation": "Thief",
    "relatives": "(see Simpson family)Father: Abraham the ThiefMother: Mona the ThiefWife: Marge the Thief",
    "first_appearance": "\"Homer vs. Lisa and the 8th Commandment\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Homer the Thief"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "hair": "Blue",
    "relatives": "Simpson family Mother: Yuma HickmanFather: Orville SimpsonBrothers: Abraham Simpson, Tyrone Simpson, Cyrus Simpson, Hubert Simpson, Chet Simpson, Bill SimpsonSisters-in-Law: Mona Simpson, Rita LaFleur and Cyrus's 15 wivesNephews: Homer Simpson and Herbert PowellNiece: Abbie SimpsonGrandfathers: \"Old Tut\" Simpson, Willard HickmanGrandmothers: \"Happy\" Dinsdale, Theodora HutshingNiece-in-Law: Marge BouvierGreat Nephew: Bart SimpsonGreat Nieces: Lisa Simpson, Maggie Simpson",
    "first_appearance": "\"Bart Gets Hit by a Car\"",
    "name": "Hortense Simpson"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "relatives": "Parents: Orville Simpson and Yuma HickmanBrothers: Abraham Simpson, Tyrone Simpson, Cyrus Simpson, Chet Simpson and Bill SimpsonSister: Hortense SimpsonDaughter: Dr. SimpsonSisters-in-Law: Mona Simpson, Rita LaFleur and Cyrus's 15 wivesNephews: Homer Simpson, Herbert Powell, \"Millionaire Actor\" Simpson, and Frank SimpsonNieces: Abbie Simpson and Valerie RothmanNiece-in-Law: Marge BouvierNephew-in-Law: Dave RothmanGrandfathers: \"Old Tut\" Simpson and Willard HickmanGrandmothers: \"Happy\" Dinsdale and Theodora HutshingGreat-Nephews: Bart Simpson and Stanley SimpsonGreat-Nieces: Lisa Simpson, Maggie Simpson",
    "first_appearance": "The Funeral",
    "name": "Hubert Simpson"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "relatives": "Parents: Abraham Simpson I and Gabby CrouseSiblings: \"Old Tut\" Simpson and Lou SimpsonHalf-Siblings: Gaston Simpson and Dulcine SimpsonHalf-Aunt: Eliza SimpsonGrandparents: Virgil Simpson and Mabel SimpsonNephews: Orville Simpson, Echardt Simpson, Bob Simpson and Boris SimpsonNieces: Twitta Simpson, Elrita Simpson, Bonita Simpson, Twyla SimpsonGreat-Nephews: Abraham Simpson, Cyrus Simpson, Chet Simpson, Tyrone Simpson, Bill Simpson, Hubert Simpson, Echardt Simpson II and Vern SimpsonGreat-Nieces: Verna Simpson, Lotus Simpson and Hortense SimpsonGreat-Great-Nephews: Homer Simpson, Herbert Powell and Frank SimpsonGreat-Great-Niece: AbbieGreat-Great-Great-Nephews: Bart Simpson and Stanley SimpsonGreat-Great-Great-Nieces: Lisa Simpson and Maggie Simpson",
    "first_appearance": "The Simpsons Uncensored Family Album",
    "name": "Hugo Simpson I"
  },
  {
    "sex": "Male",
    "relatives": "Parents: Joe Puffing GoatMary Frowning CloudSisters: Winifred Running GoatJane Nervous Goat",
    "first_appearance": "The Simpsons Uncensored Family Album",
    "name": "Humphrey Little Goat"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Balding",
    "relatives": "Simpson family",
    "first_appearance": "\"Lisa the Simpson\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Hurt Leg Simpson Relative"
  },
  {
    "sex": "Female",
    "relatives": "Parents: Joe Puffing GoatMary Frowning CloudSiblings: Winifred Running GoatHumphrey Little Goat",
    "first_appearance": "The Simpsons Uncensored Family Album",
    "name": "Jane Nervous Goat"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Blonde",
    "relatives": "Husband: JerryEx-husband: Bart Simpson Ex-mother-in-law: Marge Simpson Ex-father-in-law: Homer Simpson Ex-sisters-in-law: Lisa and Maggie Simpson Ex-grandfathers-in-law: Abraham Simpson and Clancy BouvierEx-grandmothers-in-law: Mona Simpson and Jacqueline BouvierChildren: Picard SimpsonKirk SimpsonEx-Stepson: Bart Simpson, Jr.Ex-Nieces: Zia Simpson and Maggie JuniorEx-boyfriend: Todd Flanders",
    "voiced_by": "Amy Poehler",
    "name": "Jenda Simpson"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "hair": "black",
    "relatives": "Wife: Mary Frowning Cloud  Children: Winifred Running Goat,  Humphrey Little Goat,  Jane Nervous Goat",
    "first_appearance": "The Simpsons Uncensored Family Album",
    "name": "Joe Puffing Goat"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Bald",
    "occupation": "Jug band manager",
    "relatives": "Simpson family",
    "first_appearance": "\"Lisa the Simpson\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Jug Band Manager"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Blonde",
    "relatives": "Mother: Maggie Simpson, Sr.Father: One of the Maggie's band members (hinted)Gerald Samson (hinted)Grandfathers: Homer Simpson and Mr. SamsonGrandmothers: Marge Simpson and Mrs. SamsonMaternal Aunt: Lisa SimpsonMaternal Uncles: Bart Simpson and Hugo Simpson II (non-canon)Maternal Cousins: Kirk Simpson, Picard Simpson and Zia SimpsonMaternal Uncle by marriage: Milhouse Van HoutenEx-aunt by marriage : JendaGreat-grandfathers: Abe Simpson and Clancy BouvierGreat-grandmothers: Mona Simpson and Jacqueline BouvierGreat-aunts: Patty and Selma BouvierGreat-great-aunt: Hortense SimpsonGreat-great-uncles: Bill, Cyrus, Chet, Tyrone and Hubert SimpsonGreat-half-uncle: Herbert PowellGreat-half-aunt: AbbieGreat-great grandfathers: Orville Simpson,Pépé Bouvier,Ferdinand Gurney,Jay OlsenGreat-great grandmothers: Yuma Hickman,Bambi Bouvier,Alvarine Bisque,Janet Olsen",
    "first_appearance": "\"Bart to the Future\"",
    "name": "Maggie Simpson, Jr."
  },
  {
    "sex": "Male",
    "status": "Fictional",
    "hair": "Black",
    "relatives": "Wife: Maggie SimpsonBrother in-Law: Bart Simpson Hugo Simpson, Bartie ZiffSister in-Law: Lisa Simpson and KamalaFather in Law: Homer SimpsonMother in Law: Marge Simpson",
    "first_appearance": "\"Marge on the Lam\"",
    "name": "Maggie's Husband"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Bald",
    "occupation": "Actor",
    "relatives": "Father: Tyrone Simpson  Brother: Frank Simpson  Cousins: Homer Simpson, Valerie Rothman, Dr. Simpson, Herbert Powell, Abbie Simpson and Omar Simpson Grandparents: Orville Simpson and Yuma Hickman  Uncles: Bill Simpson, Hubert Simpson, Abraham Simpson, Chet Simpson, Cyrus Simpson  Aunt: Hortense SimpsonMarital aunts: Mona Simpson, Rita LaFleur and Cyrus' 15 wives 1st Cousins Once Removed: Maggie Simpson, Lisa Simpson, Bart Simpson, Hugo Simpson II (non-canon)  Cousins-in-Law: Marge Simpson, Dave Rothman  Nephew: Stanley Simpson",
    "first_appearance": "\"Lisa the Simpson\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Millionaire Actor"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Black",
    "occupation": "Snitch",
    "relatives": "Simpson family  Cousin: Homer Simpson  Mother: Hortense Simpson",
    "first_appearance": "\"Lisa the Simpson\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Prison Snitch (Simpson Relative)"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "hair": "Blonde",
    "relatives": "Father: Virgil SimpsonMother: Mabel SimpsonHalf-Sister: Eliza SimpsonHalf-Brother-in-Law: Milford Van HoutenWife: Gabby CrouseDaughters-in-Law: \"Happy\" Dinsdale and Zorina OvadiaGrandsons: Orville and Boris SimpsonGreat Grandson: Abraham Simpson IIGreat Great Grandson: Homer SimpsonGreat Great Great Grandchildren: Bart, Stanley, Lisa and Maggie SimpsonSons: \"Old Tut\" Simpson, Lou Simpson and Hugo Simpson IStepchildren: Gaston and Dulcine Simpson",
    "first_appearance": "\"The Color Yellow\"",
    "name": "Abraham Simpson I"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "alias(es)": "Vegas Wife, Britney Beers, Vegas Mom, Malt Liquor Mommy (Bart)",
    "hair": "Red",
    "occupation": "Waitress",
    "relatives": "Ex-husband: Homer Simpson  Husband: Abraham SimpsonFather-in-law: Orville SimpsonMother-in-law: Yuma HickmanBrothers-in-laws: Bill SimpsonCyrus SimpsonChet SimpsonTyrone SimpsonHubert SimpsonSister-in-laws: Hortense SimpsonStep-sons: Homer SimpsonHerbert PowellStep-daughter: Abbie SimpsonStep-daughter-in-law: Marge BouvierStep-grandson: Bart SimpsonStep-granddaughters: Lisa SimpsonMaggie SimpsonSisters-in-Laws: Cyrus's 15 wives'",
    "first_appearance": "\"Viva Ned Flanders\"",
    "voiced_by": "Nancy Cartwright  Pamela Hayden",
    "name": "Amber Simpson"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Blonde'",
    "relatives": "Father: Bart SimpsonGrandparents Paternal: Homer and Marge Simpson Aunts: Lisa Simpson, Maggie Simpson< Great-Aunts: Patty Bouvier, Selma Bouvier Great-Uncle: Herb PowellGreat-Grandparents: Abraham Simpson, Clancy Bouvier, Jacqueline Bouvier, Mona Simpson",
    "first_appearance": "\"Bart Gets an \"F\"\"",
    "voiced_by": "Nancy Cartwright",
    "name": "Bart Simpson, Jr."
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Bald",
    "occupation": "Owner of an unsuccessful shrimp company",
    "relatives": "Father: Orville SimpsonMother: Yuma HickmanBrothers: Bill, Cyrus, Abe, Tyrone & Hubert SimpsonSister: Hortense SimpsonGrandfathers: \"Old Tut\" Simpson and Willard HickmanGrandmothers: \"Happy\" Dinsdale and Theodora HutshingSisters-in-Law: Mona Simpson, Rita LaFleur and Cyrus's 15 wivesUncles: Boris Simpson and Zeke HickmanNephews: Homer Simpson, Herbert Powell and Frank SimpsonNieces: Abbie Simpson and Valerie SimpsonNephew-in-Law: Dave RothmanNiece-in-Law: Marge BouvierGreat-Nephew: Bart SimpsonGreat-Nieces: Lisa and Maggie Simpson",
    "first_appearance": "\"Lisa the Simpson\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Chet Simpson"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "hair": "Bushy and curly, unknown",
    "relatives": "Husband: Sven SimpsonChildren: Rupert Simpson and Lambert SimpsonDaughter in-law: Winifred Running GoatFather-in-law: Edward Oswald Simpson Sr.Grandchildren: Trixie Simpson, Prudence Simpson, Galston Simpson, Garwood Simpson and Ivy SimpsonGreat-grandchildren: Howland Simpson, Hiram Simpson, Zeke Simpson, Pippa Simpson and Floyd SimpsonGreat-great-granddaughter: Eliza Simpson",
    "first_appearance": "The Simpsons Uncensored Family Album",
    "name": "Claretta Simpson"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Gray",
    "occupation": "WWII bomber pilot",
    "relatives": "Parents: Orville Simpson and Yuma HickmanSiblings: Abraham Simpson, Bill Simpson, Chet Simpson, Hortense Simpson, Tyrone Simpson and Hubert SimpsonSpouses: Fifteen Tahitian wivesNiece: Abbie SimpsonNephews: Homer Simpson, Herbert Powell, Millionaire Actor and Frank SimpsonNiece-in-Law: Marge BouvierGreat-Nieces: Lisa Simpson and Maggie SimpsonGreat-Nephews: Bart Simpson and Stanley SimpsonPaternal Grandparents: \"Old Tut\" Simpson and \"Happy\" DinsdaleMaternal Grandparents: Willard Hickman and Theodora HutshingGreat-Grandfathers: Abraham Simpson I, Horatio Dinsdale and Bertram HickmanGreat-Grandmothers: Gabby Crouse, Edwina Forayter and Nellie BalliwickGreat-Great-Grandparents: Virgil Simpson and Mabel Simpson",
    "first_appearance": "Simpson Christmas Stories",
    "voiced_by": "Hank Azaria",
    "name": "Cyrus Simpson"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Yellow",
    "occupation": "Doctor",
    "relatives": "Father: Hubert SimpsonGrandparents: Orville Simpson and Yuma HickmanUncles: Abraham Simpson, Cyrus Simpson, Bill Simpson, Tyrone Simpson, Chet SimpsonAunt: Hortense SimpsonMarital aunts: Mona Simpson, 15 unnamed and Rita LaFleurCousins: Homer Simpson, Herbert Powell, Abbie, Frank Simpson and UnnamedCousin-in-law: Marge SimpsonFirst cousins once removed: Bart Simpson, Lisa Simpson, Maggie Simpson and Stanley Simpson",
    "first_appearance": "\"Lisa the Simpson\"",
    "voiced_by": "Tress MacNeille",
    "name": "Dr. Simpson"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "hair": "Blonde",
    "relatives": "Father: Hiram SimpsonMother: Mabel SimpsonStepfather: Virgil SimpsonMaternal Half-brother: Abraham Simpson Sr.Half-nephews: \"Old Tut\" Simpson, Lou Simpson and Hugo Simpson IHalf-great-nephews: Orville Simpson and Boris SimpsonHalf-great-nieces: Twitta Simpson, Bonita Simpson and Elrita SimpsonHalf-great-great-nephews: Abraham Simpson II, Bill Simpson, Hubert Simpson, Cyrus Simpson, Tyrone SimpsonHalf-great-great-niece: Hortense SimpsonHalf-great-great-great-nephews: Homer Simpson, Herbert Powell, Frank Simpson and UnnamedHalf-great-great-great-nieces: Abbie and Valerie RothmanHalf-great-great-great-great-nephews: Bart Simpson and Stanley SimpsonHalf-great-great-great-great-nieces: Lisa Simpson and Maggie SimpsonHusband: Milford Van HoutenGreat-Great-Great-Great-Great Grandson: Milhouse Van Houten Great-Great-Great-Great-Grandson: Kirk and Norbert Van HoutenGreat-Great-Great-Grandson: Grandpa Van HoutenUncles: Howland, Zeke and Floyd SimpsonAunt: Pippa SimpsonGrandfather: Garwood SimpsonGreat-Grandfather: Rupert SimpsonGreat-Great-Grandfather: Sven Simpson",
    "first_appearance": "\"The Color Yellow\"",
    "voiced_by": "Yeardley Smith",
    "name": "Eliza Simpson"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "hair": "Grey",
    "relatives": "Great-Grandfather: Edward Simpson Sr.  Wife: Clowta Stillman  Sons: Hiram Simpson Howland Simpson,  Zeke Simpson &  Floyd Simpson  Daughter: Pippa Simpson  Parents: Rupert Simpson  Winifred Running Goat Sister:Trixie Simpson  Uncle: Lambert Simpson",
    "first_appearance": "The Simpsons Uncensored Family Album",
    "name": "Garwood Simpson"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "hair": "Brown",
    "occupation": "Sharecropper",
    "relatives": "Ex-Wife: Mabel SimpsonDaughter: Eliza SimpsonSon-in-Law: Milford Van HoutenFather: Garwood SimpsonMother: Clowta StillmanBrothers: Howland, Zeke and Floyd SimpsonSister: Pippa SimpsonGrandfathers: Rupert Simpson and Omar StillmanGrandmothers: Winifred Running Goat and Ettiwanda TrownseGreat Grandfather: Sven SimpsonEx-Father-in-Law: Troy GurneyEx-Mother-in-Law: Jen Gurney",
    "first_appearance": "\"The Color Yellow\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Hiram Simpson"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "hair": "Brown",
    "relatives": "Father Garwood SimpsonMother: Clowta StillmanUncles: Galston Simpson, Clem Stillman, Clancey Stillman and Dewey StillmanMarital uncle: Gaylord StempleAunts: Trixie Simpson, Prudence Simpson, Ivy Simpson and Ogilvie StillmanGreat-uncles: Lambert Simpson and Humphrey Little GoatGreat-aunt: Jane Nervous GoatGrandfathers: Omar Stillman and Rupert SimpsonGrandmothers: Ettiwanda Trownse and Winifred Running GoatGreat-grandfathers: Sven Simpson and Joe Puffing GoatGreat-grandmothers: Claretta Ethridge and Mary Frowning CloudCousins: Paco Stemple, Caleb Stemple and Vic StempleWife: Gabby CrouseSiblings: Zeke Simpson, Pippa Simpson and Floyd SimpsonChildren: Lou Simpson, Dulcine Simpson, \"Old Tut\" Simpson, Gaston Simpson and Hugo Simpson IGrandchildren: Orville Simpson, Twitta Simpson, Bonita Simpson, Elrita Simpson, Boris Simpson, Eckhardt Simpson, Twyla Simpson and Bob SimpsonGreat-grandchildren: Abraham Simpson II, Bill Simpson, Chet Simpson, Tyrone Simpson, Hortense Simpson, Hubert Simpson, Eckhardt Simpson II, Verna Simpson, Vern Simpson, Lotus Simpson, Fernice Schedeen and Ingrid SchedeenGreat-great-grandchildren: Homer Simpson, Herbert Powell, Abbie, Dr. Simpson, Omar Simpson, Frank Simpson, Unnamed, Mort Krupp, Connie Krupp, Endora Krupp, Archie Krupp (adopted), Lola Krupp and Pomona KruppGreat-great-great-grandchildren: Bart Simpson, Lisa Simpson, Maggie Simpson, Stanley Simpson, Brit Simpson, Lily Simpson, Magpie Simpson, Alberta Bazaar, Violet Bazaar and Hazel Bazaar",
    "first_appearance": "The Simpsons Uncensored Family Album",
    "name": "Howland Simpson"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "The Evil Twin",
    "hair": "Blond (yellow)",
    "relatives": "Father: Homer SimpsonMother: Marge SimpsonTwin Brother: Bart SimpsonSisters: Lisa Simpson and Maggie SimpsonGrandfathers: Abraham Simpson and Clancy BouvierGrandmothers: Mona Simpson and Jacqueline BouvierAunts: Patty Bouvier, Selma Bouvier and Abbie SimpsonUncle: Herbert PowellAdoptive Cousin: Ling BouvierGreat-Uncles: Bill Simpson, Chet Simpson, Tyrone Simpson, Hubert Simpson, Cyrus Simpson, Arthur Bouvier, Herman Bouvier, JoJo Bouvier, Chester Bouvier and Lou GurneyGreat-Aunts: Hortense Simpson, Kari Olsen, Charlene Bouvier and Gladys GurneyGreat-Grandfathers: Orville Simpson, Jay Olsen, Pépé Bouvier and Ferdinand GurneyGreat-Grandmothers: Yuma Hickman, Janet Olsen, Bambi Petitbois and Alvarine Bisque",
    "first_appearance": "\"Treehouse of Horror VII\"",
    "voiced_by": "Nancy Cartwright",
    "name": "Hugo Simpson II"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "hair": "Brown",
    "relatives": "Grandfather: Edward Simpson Sr.Father: Sven SimpsonMother: Claretta SimpsonBrother: Rupert Simpson",
    "first_appearance": "\"The Simpsons Uncensored Family Album\"",
    "name": "Lambert Simpson"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "hair": "Tall blue beehive",
    "occupation": "Homemaker",
    "relatives": "Ex-Husband: Hiram SimpsonHusband: Virgil SimpsonDaughter: Eliza SimpsonSon: Abraham Simpson ISon-in-Law: Milford Van HoutenDaughter-in-Law: Gabby CrouseGrandchildren: \"Old Tut\" Simpson, Lou Simpson and Hugo Simpson IStep-Grandchildren: Gaston and Dulcine SimpsonGreat-Grandchildren: Orville Simpson, Bonita Simpson, Elrita Simpson, Twitta Simpson, Boris Simpson, Echardt Simpson, Bob Simpson and Twyla SimpsonGreat Great Grandchildren: Abraham Simpson II, Bill Simpson, Cyrus Simpson, Chet Simpson, Tyrone Simpson Hubert Simpson, Verna Simpson, Vern Simpson, Echardt Simpson II and Lotus SimpsonGreat Great Great Grandchildren: Homer Simpson, Herbert Powell and AbbieGreat Great Great Great Grandchildren: Bart Simpson, Hugo Simpson II (non-canon), Lisa Simpson, Maggie Simpson and Grandpa Van HoutenGreat-great-great-great-great-grandchildren: Kirk Van Houten and Norbert Van Houten (through Eliza)Great-great-great-great-great-great-grandchildren: Milhouse Van Houten and Annika Van Houten (through Eliza)",
    "first_appearance": "\"The Color Yellow\"",
    "voiced_by": "Julie Kavner",
    "name": "Mabel Simpson"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "hair": "Yellow Gray (currently)",
    "relatives": "Parents: Abraham Simpson I and Gabby CrousePaternal grandparents: Virgil Simpson and Mabel SimpsonSiblings: Lou Simpson and Hugo Simpson IHalf-Siblings: Gaston Simpson and Dulcine SimpsonHalf-aunt: Eliza SimpsonMarital half-uncle: Milford Van HoutenWife: \"Happy\" DinsdaleChildren: Orville, Boris, Bonita, Elrita and Twitta SimpsonNephew: Echardt SimpsonGreat-Nephew: Echardt Simpson IIFather-in-Law: Horatio DinsdaleMother-in-Law: Edwina ForayterDaughter-in-Law: Yuma HickmanGrandsons: Abraham, Cyrus, Chet, Hubert, Tyrone and Bill SimpsonGranddaughter: Hortense SimpsonGranddaughters-in-Law: Mona Simpson, Rita LaFleur and Cyrus's 15 wivesGreat-Grandsons: Homer Simpson, Herbert Powell and Frank SimpsonGreat-Granddaughters: Abbie Simpson and Valerie RothmanGreat-Granddaughter-in-Law: Marge BouvierGreat-Grandson-in-Law: Dave RothmanGreat-Great-Grandsons: Bart Simpson and Stanley SimpsonGreat-Great-Granddaughters: Lisa and Maggie SimpsonSecond Cousins: Moselle, Louise and Jacques StempleOlther relatives",
    "first_appearance": "The Simpsons Uncensored Family Album",
    "name_seen": "Great-Great-Grampa Simpson",
    "name": "\"Old Tut\" Simpson"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "hair": "White (formerly brown)",
    "occupation": "Disciplinarian",
    "relatives": "Grandfathers: Abraham Simpson I and Horatio DinsdaleGrandmothers: Gabby Crouse and Edwina ForayterUncles: Lou, Hugo Simpson I and Udell \"Spunky\" DinsdaleHalf-Uncle: Gaston SimpsonHalf-Aunt: Dulcine SimpsonMarital Aunt: Zorina OvadiaHalf-great-aunt: Eliza SimpsonMarital half-great-uncle: Milford Van HoutenCousins: Echardt, Bob and Twyla SimpsonWife: Yuma HickmanBrother-in-Law: Zeke HickmanSons: Hubert, Abraham, Cyrus, Chet, Tyrone and Bill SimpsonDaughter: Hortense SimpsonGrandchildren: Homer Simpson, Herbert Powell, Abbie Simpson, Valerie Rothman, \"Millionaire Actor\" Simpson, and Frank SimpsonGranddaughter-in-Law: Marge BouvierGrandson-in-Law: Dave RothmanGreat-Grandchildren: Bart, Lisa, Maggie and Stanley SimpsonParents: \"Old Tut\" Simpson and \"Happy\" Dinsdale Sisters: Bonita Simpson, Elrita Simpson and Twitta SimpsonFather-in-Law: Willard HickmanMother-in-Law: Theodora HutshingBrother: Boris SimpsonDaughters-in-Law: Mona, Rita, 15 unnamed and Amber Simpson",
    "first_appearance": "\"Bart Gets Hit by a Car\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Orville Simpson"
  },
  {
    "sex": "Female",
    "relatives": "Father: Garwood SimpsonMother: Clowta StillmanSimpson family",
    "first_appearance": "Unknown",
    "name": "Pippa Simpson"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "hair": "Brown",
    "relatives": "Father: Rupert SimpsonMother: Winifred Running GoatBrother: Garwood Simpson",
    "first_appearance": "The Simpsons Uncensored Family Album",
    "name": "Prudence Simpson"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "hair": "Brown",
    "relatives": "Grandfather: Edward Simpson Sr.Wife: Winifred Running GoatChildren: Trixie, Prudence, Galston, Ivy and GarwoodFather: Sven SimpsonMother: Claretta SimpsonBrother: Lambert Simpson",
    "first_appearance": "The Simpsons Uncensored Family Album",
    "name": "Rupert Simpson"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "hair": "5 strands",
    "relatives": "Grandfather: George Simpson Wife: Claretta Simpson Sons: Lambert Simpson and Rupert SimpsonGrandchildren: Garwood Simpson, Trixie Simpson, Prudence Simpson, Ivy Simpson and Galston SimpsonGreat Grandchildren: Floyd Simpson, Howland Simpson and Pippa SimpsonGreat-Great-Great Grandchildren: Orville Simpson, Twitta Simpson, Bonita Simpson, Elrita Simpson and Boris SimpsonGreat-great-great-great-grandchildren: Abraham Simpson, Bill Simpson, Hortense Simpson, Hubert Simpson, Chet Simpson, Cyrus Simpson and Tyrone SimpsonGreat-great-great-great-great-grandchildren: Homer Simpson, Herbert Powell, Abbie, Frank Simpson, Valerie Rothman, Unnamed and Omar SimpsonGreat-great-great-great-great-great-grandchildren: Bart Simpson, Lisa Simpson, Maggie Simpson and Stanley Simpson Brother Homer Simpson",
    "first_appearance": "The Simpsons Uncensored Family Album",
    "name": "Sven Simpson"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "relatives": "Parents: Rupert Simpson and Winifred Running GoatHusband: Gaylord StempleChildren: Vic Stemple, Caleb and Paco Stemple",
    "first_appearance": "The Simpsons Uncensored Family Album",
    "name": "Trixie Simpson"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "Pennywise",
    "hair": "Blond",
    "occupation": "Retired",
    "relatives": "Parents: Orville Simpson and Yuma HickmanBrothers: Abraham Simpson, Hubert Simpson, Cyrus Simpson, Bill Simpson and Chet SimpsonSister: Hortense SimpsonSisters-in-Law: Mona Simpson, Rita LaFleur and 15 unnamedSons: Frank Simpson and a Millionaire ActorGrandson: Stanley SimpsonNephews: Homer Simpson and Herbert PowellNieces: Abbie Simpson and Valerie RothmanNephew-in-Law: Dave RothmanNiece-in-Law: Marge BouvierGreat-Nephew: Bart SimpsonGreat-Nieces: Lisa Simpson and Maggie Simpson",
    "first_appearance": "\"Catch 'Em if You Can\"",
    "voiced_by": "Hank Azaria",
    "name": "Tyrone Simpson"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "hair": "Black",
    "occupation": "Slave",
    "relatives": "Wife: Mabel SimpsonSon: Abraham SimpsonStep-Daughter: Eliza SimpsonStepson-in-Law: Milford Van HoutenGrandchildren: \"Old Tut\" Simpson, Lou Simpson, Dulcine Simpson, Hugo Simpson, and Gaston SimpsonGreat Grandchildren: Orville Simpson, Bonita Simpson, Elrita Simpson, Twitta Simpson, Boris Simpson, Echardt Simpson, Bob Simpson and Twyla SimpsonGreat Great Grandchildren: Abraham Simpson II, Bill Simpson, Cyrus Simpson, Chet Simpson, Tyrone Simpson Hubert Simpson, Verna Simpson, Vern Simpson, Echardt Simpson II and Lotus SimpsonGreat Great Great Grandchildren: Homer Simpson, Herbert Powell and AbbieGreat Great Great Great Grandchildren: Bart Simpson, Hugo Simpson II (non-canon), Lisa Simpson and Maggie Simpson",
    "first_appearance": "\"The Color Yellow\"",
    "voiced_by": "Wren T. Brown",
    "name": "Virgil Simpson"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "occupation": "Frontiersman",
    "relatives": "Father: Garwood SimpsonMother: Clowta StillmanBrothers: Howland Simpson, Floyd SimpsonSister: Pippa Simpson",
    "first_appearance": "The Simpsons Uncensored Family Album",
    "name": "Zeke Simpson"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "Airport bird shooter",
    "relatives": "Father: Frank SimpsonUncle: UnnamedGreat-Uncles: Abraham Simpson II, Hubert Simpson, Chet Simpson, Bill Simpson and Cyrus Simpson Great-Aunt: Hortense SimpsonMarital Great-Aunts: Mona Simpson, Rita LaFleur and Cyrus's 15 wives1st Cousins Once Removed: Homer Simpson, Herbert Powell, Abbie Simpson and Valerie RothmanSecond Cousins: Bart Simpson, Lisa Simpson and Maggie SimpsonGrandfather: Tyrone SimpsonGreat-Grandfather: Orville SimpsonGreat-Grandmother: Yuma Hickman Distant relatives: Simpson family",
    "first_appearance": "\"Lisa the Simpson\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Stanley Simpson"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "hair": "Brown",
    "relatives": "Husband: Garwood Simpson  Sons: Howland Simpson,  Zeke Simpson, Hiram Simpson  Floyd Simpson  Daughter: Pippa Simpson  Parents: Omar Stillman  Ettiwanda Trownse",
    "first_appearance": "The Simpsons Uncensored Family Album",
    "name": "Clowta Stillman"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Bald",
    "occupation": "Suer",
    "relatives": "Simpson family",
    "first_appearance": "\"Lisa the Simpson\"",
    "voiced_by": "Dan Castellaneta",
    "name": "\"Suing\" Simpson Relative"
  },
  {
    "name": "Ivy Simpson"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Blonde with one blue lock",
    "location": "Van Houten House, Springfield, Springfield's State",
    "relatives": "Mother: Lisa SimpsonFather : Milhouse Van HoutenGrandfathers: Homer Simpson and Kirk Van HoutenGrandmothers: Marge Simpson and Luann Van HoutenMaternal Uncle: Bart Simpson Maternal Aunt: Maggie SimpsonMaternal Cousins: Picard Simpson, Kirk Simpson, and Maggie Jr. Great-Grandfathers: Southern Cracker Manager, Grandpa Van Houten, Clancy Bouvier and Abraham SimpsonGreat- Grandmothers: Jacqueline Bouvier, Nana Sophie, Mona Simpson and Grandma Van HoutenGreat-uncles: Herbert Powell, Norbert Van Houten and Bastardo MussoliniGreat-aunts: Abbie Simpson, Patty Bouvier, Selma Bouvier and Luann's Sister1st Cousins Once Removed: Annika Van Houten and Ling Bouvier (adopted)",
    "first_appearance": "Holidays of Future PassedDays of Future Future (photographed) ",
    "voiced_by": "Yeardley Smith",
    "name": "Zia Simpson"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "relatives": "Husband: Lou Simpson  Son: Bob Simpson,   Echardt Simpson  Daughter: Twyla Simpson",
    "first_appearance": "The Simpsons Uncensored Family Album",
    "name": "Zorina Ovadia"
  },
  {
    "sex": "Male",
    "status": "Fictional",
    "first_appearance": "\"Some Enchanted Evening\"",
    "voiced_by": "Harry Shearer",
    "name": "Marge's demons"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "alias(es)": "Gretchen Bellsom",
    "hair": "Blonde",
    "relatives": "Son: Homer Jr.Boyfriend/Husband: Chase",
    "first_appearance": "\"Labor Pains\"",
    "first_mentioned": "Simpsons Roasting On An Open Fire",
    "voiced_by": "Elisabeth Moss",
    "name": "Gretchen"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Black",
    "relatives": "Mother: Gretchen Father: Chase",
    "first_appearance": "\"Labor Pains\"",
    "first_mentioned": "\"Marge vs. the Monorail\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Homer Jr."
  },
  {
    "sex": "Female",
    "status": "Alive",
    "alias(es)": "MomMrs. Simpson[1]Midge[2]Major MargeMarge Bouvier",
    "hair": "Blue, naturally grey",
    "occupation": "Housewife",
    "location": "742 Evergreen Terrace, Springfield, Springfield's State",
    "relatives": "Parents: Clancy Bouvier and Jacqueline BouvierSisters: Patty and Selma BouvierHusband: Homer SimpsonChildren: Bart Simpson, Lisa Simpson and Maggie SimpsonFather-in-Law: Abraham SimpsonMother-in-Law: Mona SimpsonHalf-Brother-in-Law: Herbert PowellHalf-Sister-in-Law: Abbie SimpsonCousin-in-Law: Omar SimpsonNephew: Brit SimpsonNieces: Lily and Magpie SimpsonAdoptive Niece: Ling BouvierGrandfathers: Pépé Bouvier and Ferdinand GurneyGrandmothers: Bambi Bouvier and Alvarine BisqueEx-Brothers-in-Law: Sideshow Bob, Lionel Hutz, Troy McClure, Disco Stu and Fit TonyUncles: Chester Bouvier, Arthur Bouvier, Herman Bouvier, JoJo Bouvier and Lou GurneyAunts: Charlene Bouvier and Gladys GurneyMarital Aunt: Alfreda LeDouxCousins: Pierre Bouvier, Alfreda Bouvier II, Dorothé Bouvier, Rowena Bouvier, Tootsie Bouvier, Marnie Simpson, and Dot Gurney Great Grandfather Great Grandpa Bouvier",
    "first_appearance": "\"Good Night\"",
    "voiced_by": "Julie Kavner",
    "name": "Marge Simpson"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Gray, naturally sandy blonde",
    "occupation": "Springfield DMV Employee",
    "relatives": "Parents: Clancy Bouvier and Jacqueline GurneySisters: Patty Bouvier and Marge BouvierUncles: Chester Bouvier, JoJo Bouvier, Arthur Bouvier, Herman Bouvier and Lou GurneyAunts: Charlene Bouvier and Gladys GurneyMarital Aunt: Alfreda LeDouxEx-Husbands: Sideshow Bob, Lionel Hutz, Troy McClure, Disco Stu, and Abraham SimpsonAdoptive Daughter: Ling BouvierNephew: Bart SimpsonNieces: Lisa Simpson and Maggie SimpsonGrandfathers: Pépé Bouvier and Ferdinand GurneyGrandmothers: Bambi Bouvier and Alvarine BisqueBrother-in-Law: Homer SimpsonCousins: Pierre Bouvier, Tootsie Bouvier, Dorothé Bouvier, Rowena Bouvier, Alfreda Bouvier II and Dot GurneyEx-Cousin-in-Law: Fat Tony",
    "first_appearance": "\"Simpsons Roasting on an Open Fire\"",
    "voiced_by": "Julie KavnerPamela Hayden (younger; \"Three Men and a Comic Book\")",
    "name": "Selma Bouvier"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Gray, naturally red",
    "occupation": "Springfield DMV Employee",
    "relatives": "Parents: Clancy Bouvier and Jacqueline GurneySisters: Selma Bouvier and Marge BouvierNephew: Bart SimpsonNieces: Lisa Simpson, Maggie Simpson and Ling Bouvier (adopted)Grandfathers: Pépé Bouvier and Ferdinand GurneyGrandmothers: Bambi Petitbois and Alvarine BisqueBrother-in-Law: Homer SimpsonEx-Brothers-in-Law: Sideshow Bob, Lionel Hutz, Troy McClure, Disco Stu and Fit TonyUncles: Chester Bouvier, Arthur Bouvier, Herman Bouvier, JoJo Bouvier and Lou GurneyAunts: Charlene Bouvier and Gladys GurneyMarital Aunt: Alfreda LeDouxCousins: Pierre Bouvier, Alfreda Bouvier II, Dorothé Bouvier, Rowena Bouvier, Tootsie Bouvier, Marnie Simpson and Dot Gurney",
    "first_appearance": "\"Simpsons Roasting on an Open Fire\"",
    "voiced_by": "Julie KavnerPamela Hayden (younger; \"Three Men and a Comic Book\")",
    "name": "Patty Bouvier"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "alias(es)": "Grampa Bouvier, daddy",
    "hair": "Gray (formerly brown/blue)",
    "occupation": "Navy, Baby Photographer, Flight Attendant",
    "relatives": "Parents: Pépé Bouvier and Bambi Bouvier   Wife: Jacqueline GurneySiblings: Chester Bouvier, Charlene Bouvier, Arthur Bouvier, JoJo Bouvier and Herman BouvierGrandfathers: Antoine Bouvier and Henri PetitboisGrandmothers: Françoise Billout and Marie St. JacquesAunts: Monique Bouvier, Coquette Bouvier, Fifi Bouvier and Lalique BouvierMarital Uncle: Maurice L'eauCousins: Theodore L'eau, Hi L'eau, Tilda L'eau and Rodney L'eauSister-in-Law: Alfreda LeDouxNephew: Pierre BouvierNieces: Dorothé Bouvier, Rowena Bouvier, Tootsie Bouvier and Alfreda Bouvier IIDaughters: Patty Bouvier, Selma Bouvier and Marge BouvierSon-in-Law: Homer SimpsonEx-Sons-in-Law: Sideshow Bob, Lionel Hutz, Troy McClure, Disco Stu and Fit TonyAbraham Simpson IIGrandchildren: Bart Simpson, Lisa Simpson, Maggie Simpson and Ling Bouvier (adopted)Mother-in-Law: Alvarine BisqueFather-in-Law: Ferdinand GurneyBrother-in-Law: Lou GurneySister-in-Law: Gladys GurneyMarital Niece: Dot Gurney",
    "first_appearance": "\"The Way We Was\"",
    "voiced_by": "Harry Shearer",
    "name": "Clancy Bouvier"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "alias(es)": "GrandmaIngrid GurneyMrs. BouvierMom",
    "hair": "Gray (formerly blue)",
    "occupation": "Retired",
    "relatives": "Parents: Alvarine Bisque and Ferdinand GurneySister: Gladys Gurney  Brother: Lou GurneyGrandchildren: Bart Simpson, Lisa Simpson, Maggie Simpson and Ling Bouvier (adopted)Daughters: Patty Bouvier, Selma Bouvier and Marge BouvierSons-in-Law: Homer Simpson and Herbert PowellNiece: Dot Gurney and Marnie SimpsonHusband: Clancy BouvierGrandparents: Selma DePaul, Arturo Bisque, Ingrid Gurney and Thomas GurneyMarital Nephew: Pierre BouvierMarital Nieces: Rowena Bouvier, Dorothé Bouvier, Tootsie Bouvier and  Alfreda Bouvier IIMarital Grandnephew: Brit SimpsonMarital Grandnieces: Lily Simpson and Magpie Simpson",
    "first_appearance": "\"Moaning Lisa\" (flashback)\"Bart vs. Thanksgiving\" (present-day appearance)",
    "voiced_by": "Julie Kavner",
    "name": "Jacqueline Bouvier"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Black",
    "location": "Springfield",
    "relatives": "Biological Mother: UnnamedBiological Father: UnnamedAdoptive Mother: Selma BouvierAdoptive Marital Uncle/Father: Homer SimpsonAdoptive Aunts: Patty Bouvier and Marge SimpsonAdoptive Grandfather: Clancy BouvierAdoptive Grandmother: Jacqueline BouvierAdoptive Cousins/Half-Siblings: Bart Simpson, Lisa Simpson and Maggie Simpson",
    "first_appearance": "\"Goo Goo Gai Pan\"",
    "voiced_by": "Nancy Cartwright",
    "name": "Ling Bouvier"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "hair": "Gray (formerly blue)",
    "relatives": "Father: Ferdinand GurneyMother: Alvarine GurneyGrandmothers: Selma DePaul and Ingrid GurneyGrandfathers: Arturo Bisque and Thomas GurneyBrother: Lou GurneySister: Jacqueline  GurneyNieces: Patty Bouvier, Selma Bouvier, Marge Bouvier and Dot GurneyBrother-in-Law: Clancy BouvierNephew-in-Law: Homer SimpsonGreat-Nephew: Bart SimpsonGreat-Nieces: Lisa Simpson and Maggie SimpsonAdopted Great-Niece: Ling BouvierEx-Son-in-Law: Robert Terwilliger",
    "first_appearance": "\"Selma's Choice\"",
    "voiced_by": "Julie Kavner",
    "name": "Gladys Gurney"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "hair": "Gray",
    "relatives": "Husband: Ferdinand GurneyChildren: Jacqueline Gurney, Gladys Gurney and Lou Gurney  Grandchildren: Selma Bouvier, Patty Bouvier, Marge Bouvier and Dot Gurney Great-Grandchildren: Bart Simpson, Lisa Simpson, Maggie Simpson and Ling Bouvier (adopted)Son-in-Law: Clancy BouvierGrandson-in-Law: Homer SimpsonFather-in-law: Thomas GurneyMother-in-law: Ingrid Gurney",
    "first_appearance": "\"Fear of Flying\"",
    "voiced_by": "Yeardley Smith",
    "name": "Alvarine Bisque"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "relatives": "Parents: Pépé Bouvier and Bambi PetitboisSiblings: Clancy Bouvier, Arthur Bouvier, JoJo Bouvier, Herman Bouvier and Charlene BouvierWife: Alfreda LeDouxChildren: Dorothé Bouvier, Tootsie Bouvier, Rowena Bouvier, Alfreda Bouvier II and Pierre BouvierDaughter-in-Law: Miranda PotterGrandchildren: Axel Bouvier, Holly Bouvier, Polly Bouvier, Dolly Bouvier and Lolly BouvierSister-in-Law: Jacqueline GurneyNieces: Patty Bouvier, Selma Bouvier and Marge BouvierNephew-in-Law: Homer SimpsonGreat-Nephew: Bart SimpsonGreat-Nieces: Lisa Simpson, Maggie Simpson and Ling Bouvier (adopted)",
    "first_appearance": "The Simpsons Uncensored Family Album",
    "name": "Chester Bouvier"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "relatives": "Father: Pépé BouvierMother: Bambi BouvierBrothers: Clancy, Arthur and ChesterSister: Charlene BouvierDaughter: Marnie BouvierGrandchildren: Brit Simpson, Lily Simpson and Magpie SimpsonNieces: Marge Simpson, Patty Bouvier, and Selma BouvierSisters-in-law: Jacqueline Bouvier and Alfreda LeDouxGreat-nephew: Bart SimpsonGreat-nieces: Lisa Simpson, Maggie Simpson and Ling Bouvier (adopted)",
    "first_appearance": "The Simpsons Uncensored Family Album",
    "name": "JoJo Bouvier"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "hair": "Brown",
    "occupation": "Merchant",
    "relatives": "Parents: Antoine Bouvier and Françoise BilloutSisters: Monique Bouvier, Lalique Bouvier, Fifi Bouvier and Coquette BouvierWife: Bambi PetitboisBrother-in-Law: Maurice L'eauChildren: Clancy Bouvier, Charlene Bouvier, JoJo Bouvier, Chester Bouvier, Herman Bouvier and Arthur BouvierNephews: Theodore L'eau and Rodney L'eauNieces: Hi L'eau and Tilda L'eauDaughter-in-Law: Jacqueline GurneyGranddaughters: Patty Bouvier, Selma Bouvier and Marge BouvierGrandson-in-Law: Homer SimpsonGreat-Grandchildren: Bart Simpson, Lisa Simpson, Maggie Simpson and Ling Bouvier (adopted)",
    "first_appearance": "The Simpsons Uncensored Family Album",
    "name": "Pépé Bouvier"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "alias(es)": "Vic",
    "hair": "Black",
    "occupation": "Unknown",
    "location": "France",
    "relatives": "Wife: Florette DuChampsSon: Victor \"Hugo\" Bouvier IIGrandchildren: Honoré Bouvier, Didi and Yves \"Gauche\" Bouvier",
    "first_appearance": "The Simpsons Uncensored Family Album",
    "name": "Victor Bouvier"
  },
  {
    "sex": "Male",
    "relatives": "Parents: Victor BouvierFlorette DuChamps Wife: Gabrielle Gateau Children: Honoré Bouvier  Didi Bouvier  Yves \"Gauche\" Bouvier  Grandchildren: Cléo Bouvier  Théo Bouvier  Fr. René Bouvier  Marcel Bouvier",
    "first_appearance": "The Simpsons Uncensored Family Album",
    "name": "Victor Bouvier II"
  },
  {
    "sex": "Female",
    "relatives": "Parents: Yves Bouvier  Marie Trousseau  Brothers: Théo Bouvier  Fr. René  Marcel Bouvier",
    "first_appearance": "The Simpsons Uncensored Family Album",
    "name": "Cléo Bouvier"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "relatives": "Parents: Victor Bouvier II  Gabrielle Gateau  Brothers: Honoré Bouvier  Yves Bouvier",
    "first_appearance": "The Simpsons Uncensored Family Album",
    "name": "Didi Bouvier"
  },
  {
    "sex": "Male",
    "relatives": "Parents: Victor Bouvier II  Gabrielle Gateau  Siblings: Didi Bouvier  Yves Bouvier",
    "first_appearance": "The Simpsons Uncensored Family Album",
    "name": "Honoré Bouvier"
  },
  {
    "sex": "Male",
    "occupation": "Mime",
    "relatives": "Wife: Angelique MarceauParents: Yves Bouvier and Marie Trousseau  Children: Antoine Bouvier, Jacques Bouvier, Charlemagne Bouvier, Etienne Bouvier, Babette Bouvier, Georgette Bouvier, Erique Bouvier, Alfred Bouvier and Lance Bouvier",
    "first_appearance": "The Simpsons Uncensored Family Album",
    "name": "Marcel Bouvier"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "relatives": "Parents: Henri Petitbois and Marie St. JacquesHusband: Pépé BouvierChildren: Clancy Bouvier, Charlene Bouvier, JoJo Bouvier, Chester Bouvier and Arthur BouvierDaughter-in-Law: Jacqueline BouvierGrandchildren: Marge, Patty and Selma BouvierGrandson-in-Law: Homer SimpsonGreat-Grandchildren: Bart, Lisa, Maggie Simpson and Ling Bouvier (adopted)",
    "first_appearance": "The Simpsons Uncensored Family Album",
    "name": "Bambi Petitbois"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "hair": "Grey",
    "relatives": "Parents: Victor Bouvier II Gabrielle Gateau Wife: Marie Trousseau  Children: Cléo Bouvier  Théo Bouvier  Fr. René Bouvier  Marcel Bouvier",
    "first_appearance": "The Simpsons Uncensored Family Album",
    "name": "Yves Bouvier"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "Stupid FlandersDevil FlandersStupid Sexy Flanders",
    "hair": "Brown",
    "occupation": "Pharmacist (previously to the show)Owner at The Leftorium (now closed)742 Evergreen Terrace (Ex-owner)Storytown Village (former)Praiseland (former)4th Grade teacher at Springfield Elementary School (temporary)",
    "relatives": "Parents: Nedsel and Agnes Flanders Sister: Nediana Flanders  Wives: Edna (deceased)Maude (deceased) andGinger FlandersEx-girlfriends: Sara Sloane and Rachel JordanSons: Rod and Todd FlandersCousins: José Flanders, Lord Thistlewick Flanders, Ted Flanders and Nedna FlandersGrandmother: Grandma Flanders",
    "first_appearance": "\"Simpsons Roasting on an Open Fire\"",
    "voiced_by": "Harry ShearerKarl Wiedergott (\"Homer to the Max\")Frank Welker (\"Treehouse of Horror X\")Tress MacNeille (screaming)",
    "name": "Ned Flanders"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "hair": "Salmon",
    "occupation": "Housewife (former)The Leftorium (former)Creator of Praiseland (closed)",
    "location": "744 Evergreen Terrace",
    "relatives": "Grandmother: UnnamedMother: UnnamedSons: Rod and Todd FlandersHusband: Ned FlandersMother-in-Law: Agnes Flanders Father-in-Law: Nedsel Flanders",
    "first_appearance": "\"Dead Putting Society\"",
    "voiced_by": "Maggie Roswell (1990–1999; 2002–present)Marcia Mitzman Gaven (1999–2000)",
    "name": "Maude Flanders"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Red",
    "occupation": "Student at Springfield Elementary School",
    "relatives": "Parents: Ned and Maude Flanders (deceased)Stepmothers: Edna and Ginger FlandersBrother: Todd FlandersAunt: Nediana FlandersUnknown ex-uncle-in-law Grandmothers: Agnes Flanders and Maude Flanders' mother                                                                              Grandfather: Nedsel Flanders",
    "first_appearance": "\"Simpsons Roasting on an Open Fire\"",
    "voiced_by": "Pamela Hayden",
    "name": "Rod Flanders"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Auburn",
    "occupation": "Student at Springfield Elementary SchoolStudent at a religious private school (formerly)",
    "relatives": "Parents: Ned and Maude Flanders (deceased) Stepmothers: Edna and Ginger FlandersBrother: Rod FlandersAunt: Nediana FlandersGrandmothers: Agnes Flanders and Maude Flanders' motherGreat-Grandmother: Grandma Flanders",
    "first_appearance": "Simpsons Roasting on an Open Fire",
    "voiced_by": "Nancy Cartwright",
    "name": "Todd Flanders"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Gray (formerly brown)",
    "relatives": "Wife: Agnes FlandersSon: Ned FlandersMother: Grandma Flanders (deceased) Father: Neduchadnezzar Flanders (deceased)Daughter: Nediana FlandersDaughters-in-Law: Maude, Edna and Ginger FlandersGrandsons: Rod and Todd Flanders  Granddaughters: Bonnie Flanders and Connie Flanders ",
    "first_appearance": "\"Sweet Seymour Skinner's Baadasssss Song\"",
    "voiced_by": "Harry Shearer",
    "name": "Nedward Flanders, Sr."
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Grey, formerly dark brown",
    "relatives": "Son: Ned FlandersDaughter: Nediana Flanders Husband: Nedward Flanders, Sr. Mother-In-law: Grandma Flanders (deceased) Grandsons: Rod Flanders and Todd Flanders  Granddaughters: Bonnie Flanders and Connie FlandersDaughters-in-law: Maude Flanders, Ginger Flanders and Edna KrabappelFather-in-law: Neduchadnezzar Flanders",
    "first_appearance": "\"Sweet Seymour Skinner's Baadasssss Song\"",
    "voiced_by": "Pamela Hayden",
    "name": "Agnes Flanders"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "alias(es)": "BessieBessie Flanders",
    "hair": "Gray, formerly blue",
    "relatives": "Husband: Neduchadnezzar FlandersSon: Nedward Flanders, Sr.Daughter-in-law: Agnes FlandersGrandson: Ned FlandersGranddaughter: Nediana FlandersGranddaughters-in-law: Maude Flanders, Edna Krabappel and Ginger FlandersGreat-Grandsons: Rod Flanders and Todd FlandersDistant Relatives: Flanders family",
    "first_appearance": "\"Lisa's First Word\"",
    "voiced_by": "Yeardley Smith[1]",
    "name": "Grandma Flanders"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "hair": "Ginger",
    "relatives": "Husband: Sir Nederick FlandersSons: Neduchadnezzar FlandersCommander Flanders",
    "first_appearance": "Flanders' Book of Faith",
    "name": "Augusta Flanders"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Brown",
    "relatives": "Father: Ted FlandersSister: Connie FlandersUncle: Ned FlandersAunt: Maude Flanders (deceased)Cousins: Rod and Todd Flanders",
    "first_appearance": "\"The Bob Next Door\"",
    "name": "Bonnie Flanders"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown",
    "relatives": "none",
    "first_appearance": "\"Midnight Rx\"",
    "voiced_by": "Harry Shearer",
    "name": "Canadian Flanders"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Brown",
    "relatives": "Father: Ted FlandersSister: Bonnie FlandersUncle: Ned FlandersCousins: Rod and Todd Flanders",
    "first_appearance": "\"The Bob Next Door\"",
    "name": "Connie Flanders"
  },
  {
    "sex": "Female",
    "hair": "Brown",
    "relatives": "Husband: Jehoshaphat Flanders",
    "first_appearance": "Flanders' Book of Faith",
    "name": "Floradora Flannery"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Brown",
    "occupation": "Waitress",
    "relatives": "Ex-Husband: Ned FlandersEx-Stepsons: Rod Flanders and Todd Flanders",
    "first_appearance": "Viva Ned Flanders",
    "voiced_by": "Tress MacNeille",
    "name": "Ginger Flanders"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "hair": "Brown",
    "relatives": "Mother: Wilhelmina DümperdorfFather: Nedmond FlandersBrother: Nedgar FlandersWife: Floradora Flannery",
    "first_appearance": "\"Flanders' Book of Faith\"",
    "name": "Jehoshaphat Flanders"
  },
  {
    "sex": "Male",
    "hair": "Dark Brown",
    "occupation": "Unknown",
    "relatives": "Ned FlandersLord Thistlewick FlandersFlanders family",
    "first_appearance": "\"Lisa the Vegetarian\"",
    "voiced_by": "Hank Azaria",
    "name": "José Flanders"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "hair": "Orange",
    "relatives": "Mother: Lady Nedwina DredfulFather: Lord Thistlewick of FlandersSiblings: Lady Nedebel, Nedmond and Sir Nederick Flanders",
    "first_appearance": "Flanders' Book of Faith",
    "name": "Lady Nedderly Flanders"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "hair": "Brown",
    "relatives": "Father: Lord Thistlewick of FlandersMother: Lady Nedwina DredfulSiblings: Nedmond, Sir Nederick and Lady Nedderly FlandersHusband: Lord Nose",
    "first_appearance": "\"Flanders' Book of Faith\"",
    "name": "Lady Nedebel Flanders"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "hair": "Orange",
    "relatives": "Husband: Lord Thistlewick of FlandersChildren: Sir Nederick, Lady Nedebel, Lady Nedderly and Nedmond Flanders",
    "first_appearance": "Flanders' Book of Faith",
    "voiced_by": " ",
    "name": "Lady Nedwina Dredful"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "hair": "Brown",
    "relatives": "Wife: Lady Nedebel Flanders",
    "first_appearance": "Flanders' Book of Faith",
    "name": "Lord Nose"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Light brown",
    "occupation": "English Lord",
    "relatives": "Cousins: Ned Flanders, José Flanders, Ted Flanders and Nedna FlandersUncles: Nedward Flanders, Sr.Aunts: Agnes FlandersCousins-in-Law: Maude Flanders, Edna Krabappel and Ginger Flanders1st Cousins Once Removed: Rod Flanders, Todd Flanders, Bonnie Flanders and Connie FlandersDistant Relatives: Flanders familyBrother: O'FlanneryGreat Great Granduncle: Lord Thistlewick of Flanders",
    "first_appearance": "\"Lisa the Vegetarian\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Lord Thistlewick Flanders"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "hair": "Brown",
    "occupation": "Knight during the Middle Ages (possible)",
    "relatives": "Wife: Lady Nedwina DredfulChildren: Sir Nederick, Lady Nedebel, Lady Nedderly and Nedmond FlandersGreat Great Grandnephew: Lord Thistlewick Flanders (possible)Great Great Grandson: Nedward Flanders",
    "first_appearance": "Flanders' Book of Faith",
    "name": "Lord Thistlewick of Flanders"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "hair": "Red (former)Light  blue",
    "occupation": "Ghost",
    "location": "Springfield",
    "relatives": "Grandmother: SusanMother: JudySons: Rod and Todd FlandersHusbands: Ned Flanders, Devil (non-canon, after death)Sister-In-Law: Edna Krabappel",
    "first_appearance": "\"Treehouse of Horror XIII\"",
    "voiced_by": "Maggie Roswell",
    "name": "Maude Flanders (ghost)"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "hair": "Brown",
    "relatives": "Mother: Wilhelmina DümperdorfFather: Nedmond FlandersBrother: Jehoshaphat FlandersWife: Some Tramp He Met In St. LouisSon: Nedward Flanders",
    "first_appearance": "\"Flanders' Book of Faith\"",
    "name": "Nedgar Flanders"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Brown",
    "relatives": "Mother: Mona FlandersFather: Nedsel FlandersBrother: Ned FlandersSisters-in-law: Maude, Ginger and Edna FlandersNephews: Rod Flanders and Todd Flanders",
    "name": "Nediana Flanders"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "hair": "Black",
    "relatives": "Father: Lord Thistlewick of FlandersMother: Lady Nedwina DredfulSiblings: Lady Nedebel, Sir Nederick and Lady Nedderly FlandersWife: Wilhelmina DümperdorfChildren: Jehoshaphat Flanders and Nedgar Flanders",
    "first_appearance": "Flanders' Book of Faith",
    "name": "Nedmond Flanders"
  },
  {
    "sex": "Female",
    "status": "Unknown",
    "hair": "Orange",
    "relatives": "Parents Commander Flanders and Charlotte O'Tara  Cousin Ned Flanders",
    "first_appearance": "Flanders' Book of Faith",
    "name": "Nedna Flanders"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "hair": "Gray",
    "occupation": "Unknown",
    "relatives": "Son: Nedward Flanders, Sr.Grandson: Ned FlandersWife: Grandma FlandersFather: Sir Nederick FlandersMother: Augusta Wynd",
    "first_appearance": "Flanders' Book of Faith",
    "voiced_by": "None",
    "name": "Neduchadnezzar Flanders"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "hair": "Brown",
    "occupation": "Commander in the army or navy",
    "relatives": "Parents: Sir Nederick Flanders and Augusta WyndBrother: Neduchadnezzar FlandersWife: Charlotte O'TaraDaughter: Nedna Flanders",
    "first_appearance": "Simp",
    "name": "Nedwynn Flanders"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "hair": "Brown",
    "relatives": "Father: Lord Thistlewick of FlandersMother: Lady Nedwina DredfulSiblings: Lady Nedderly, Nedmond, Lady Nedebel and Lady Nedebel FlandersWife: Augusta WyndChildren: Neduchadnezzar and Nedwynn Flanders",
    "first_appearance": "Flanders' Book of Faith",
    "name": "Sir Nederick Flanders"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "Brown",
    "relatives": "Cousin: Ned FlandersDaughters:Bonnie FlandersConnie Flanders",
    "first_appearance": "\"The Bob Next Door\"",
    "voiced_by": "Dan Castellaneta",
    "name": "Ted Flanders"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "hair": "Gray",
    "relatives": "Husband: Nedmond FlandersChildren: Jehoshaphat and Nedgar Flanders",
    "first_appearance": "Flanders' Book of Faith",
    "name": "Wilhelmina Dümperdorf"
  },
  {
    "sex": "Female",
    "relatives": "Husband: Neduchadnezzar Flanders  Son: Nedsel Flanders",
    "first_appearance": "Flanders' Book of Faith",
    "name": "Winifred Trout"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "alias(es)": "Fruit Bat ManHappy (one episode)Future BurnsOld Man BurnsMr. Burns (most common)Mean Man MontyBongo-head (one episode)Sir (mostly by Smithers)Burnsie (mainly by Lenny)M. Burns Monty  C.M. Burns  C. Montgomery Burns",
    "hair": "Gray, balding",
    "occupation": "SS officer (formerly)Owner of the Springfield Nuclear Power PlantPresident of the Springfield MonorailOwner of the Springfield Estadio de TorosWorld War II Veteran",
    "relatives": "Parental Grandfather/Adoptive father: Wainwright Montgomery BurnsPaternal grandmother: Evelyn GraycombMaternal Grandfather: Jean-Claude CharlesMaternal Grandmother: Ophelia CharlesFather: Clifford Burns Mother: Daphne CharlesSiblings: 11, including George Burns, Cornelius Burns, Cornelia Hernandez and Zeph BurnsGirlfriend: Maxine LombardSons: Larry BurnsWaylon Smithers, Jr. (foster son)Nieces: Pepita HernandezVictoria Burns-Vanderbilt-DuPont-Bush-RockeFeller-Symthe-Pitt-WhitneyAunt: Doreena BurnsCousins: Lyla and Mr. BumbleGrandchildren: UnnamedGreat-Grandfather: Franklin Jefferson Burns[1]Daughter-in-law: UnnamedFourth cousin: Abraham Simpson",
    "first_appearance": "\"Simpsons Roasting on an Open Fire\"",
    "voiced_by": "Christopher Collins (Early Season 1)Harry Shearer (Season 1-present)Nancy Cartwright (Angry Dad)M. Samejima (The Simpsons Arcade Game)",
    "name": "Charles Montgomery Burns"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "hair": "Gray (formerly Brown)",
    "relatives": "Parents: Wainwright Montgomery Burns and Evelyn Graycomb Wife: Daphne CharlesFather-in-law: Jean-Claude CharlesMother-in-law Ophelia CharlesChildren: Charles Montgomery Burns, George Burns, Cornelia Burns, Zeph Burns, Cornelius Burns and 10 other unnamed childrenGrandfathers: Franklin Jefferson Burns and Otto GraycombMaternal Grandmother: Lolly DuBoisGrandson: Larry BurnsGranddaughter-in-law: UnnamedGreat-grandchildren: UnnamedThird cousin: Orville Simpson",
    "first_appearance": "\"Rosebud\"",
    "voiced_by": "Harry Shearer",
    "name": "Clifford Burns"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "hair": "Grey",
    "relatives": "Husband: Sancho Hernandez Father: Unnamed Father  Mother: Daphne CharlesSiblings: Zeph Burns and Cornelius BurnsHalf-Siblings: Charles Montgomery Burns, George Burns and 10 other unnamed siblingsChildren: Pepita Hernandez",
    "name": "Cornelia Hernandez"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "hair": "Grey",
    "relatives": "Father: Unnamed Mother: Daphne Charles  Siblings: Zeph Burns Cornelia Hernandez George Burns  Charles BurnsSon:William Alphonso Burns",
    "name": "Cornelius Burns"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "alias(es)": "MaterMrs. Burns",
    "hair": "Gray",
    "occupation": "Retired",
    "relatives": "Parents: Jean-Claude Charles and Ophelia CharlesHusband: Clifford BurnsGrandfather: Syd CharlesGrandmother: Santina QuackenbushUncle: Monticello CharlesChildren: Charles Montgomery Burns, George Burns, Zeph Burns, Cornelius Burns, Cornelia Burns and 10 other unnamed childrenFather-in-Law: Wainwright Montgomery BurnsMother-in-Law: Evelyn GraycombSister-in-Law: Doreena BurnsGrandson: Larry BurnsGranddaughter-in-Law: UnnamedGreat-Grandchildren: Unnamed",
    "first_appearance": "\"Rosebud\"",
    "name_seen": "Rosebud",
    "voiced_by": "Tress MacNeilleAmy Schumer",
    "name": "Daphne Burns"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "relatives": "Parents: Wainwright Montgomery Burns and Evelyn GraycombBrother: Clifford BurnsSister-in-law: Daphne BurnsDaughter: LylaNephews and nieces: Charles Montgomery Burns, Zeph Burns, Cornelius Burns, Cornelia Burns, George Burns and 10 unnamedNephew-in-law: Sancho HernandezGreat-nephew: Larry BurnsGreat-niece: Pepita HernandezGreat-nephew-in-law: Romeo BernsteinGreat-niece-in-law: UnnamedGreat-great-nephews and nieces: David Bernstein, Levi Bernstein, Moshe Bernstein, Murray Bernstein, Saul Bernstein and several unnamed",
    "name": "Doreena Burns"
  },
  {
    "sex": "Male",
    "relatives": "Mr. Burns",
    "first_appearance": "Bart vs. the World",
    "name": "Eric Von Burns"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "relatives": "Parents: Otto Graycomb and Lolly DuBois Brothers: Axel Graycomb and Amos Graycomb Husband: Wainwright Montgomery Burns Children: Clifford and Doreena",
    "name": "Evelyn Graycomb"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "hair": "Brown",
    "occupation": "Boston Tea Party participant  Member of the Burns family",
    "relatives": "Parents: Mergatroid Burns and Marguerite Chesterton WagstaffWife: Barbara KretizerSon: Wainwright Montgomery BurnsGrandchildren: Clifford and Doreena BurnsGreat Grandchildren: Charles Montgomery Burns, George Burns, Zeph Burns, Cornelius Burns and 10 other unnamed childrenGreat Granddaugher: Cornelia BurnsGreat Great Grandchildren: Pepita Hernandez, Larry BurnsGreat Great Great Grandsons: David, Levi,Moshe, Murray, and Saul Bernstein",
    "first_appearance": "\"The Trouble with Trillions\"",
    "first_mentioned": "\"Burns, Baby Burns\"",
    "name": "Franklin Jefferson Burns"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "occupation": "Counselor of \"Camp Deadly\"",
    "relatives": "Father: George BurnsUncles: Charles Montgomery Burns, Zeph Burns and Cornelius BurnsAunt: Cornelia HernandezMarital uncle: Sancho HernandezCousins: Larry Burns and Pepita HernandezCousins-in-law: Romeo Bernstein and Unnamed (by Larry)First cousins once removed: Saul Bernstein, Murray Bernstein, Moshe Bernstein, David Bernstein and several unnamed (by Larry)Grandparents: Clifford Burns and Daphne Burns",
    "name": "Ironfist Burns"
  },
  {
    "sex": "Male",
    "status": "Alive",
    "hair": "White",
    "occupation": "Currently: UnemployedFormerly: Salesman Employee at the Springfield Nuclear Power Plant",
    "relatives": "Father: Charles Montgomery BurnsMother: Lily Bancroft (deceased)Wife: Unnamed Children: Several unnamedGrandmothers: Daphne Burns (paternal grandmother)Mimsy Bancroft (maternal grandmother) Grandfather: Clifford Burns (paternal grandfather)",
    "first_appearance": "\"Burns, Baby Burns\"",
    "first_mentioned": "\"Boy Meets Curl\"",
    "voiced_by": "Rodney Dangerfield",
    "name": "Larry Burns"
  },
  {
    "sex": "Male",
    "relatives": "Spouse: Lolly DuBois Children: Evelyn, Axel and Amos",
    "name": "Otto Graycomb"
  },
  {
    "sex": "Female",
    "status": "Alive",
    "relatives": "Parents: Sancho Hernandez and Cornelia BurnsHusband: Romeo BernsteinChildren: David, Levi, Moshe, Murray and Saul",
    "first_appearance": "The Simpsons Uncensored Family Album",
    "name": "Pepita Hernandez"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "alias(es)": "Colonel Burns",
    "hair": "Grey",
    "occupation": "Plantation Slave Owner during the Antebellum South. (1860 - 1865)  Owner of the Springfield Atom Mill (1865 - 1918)",
    "relatives": "Father:Franklin Jefferson BurnsGrandfather: Charles O'Neal BurnsWife: Evelyn GraycombSon: Clifford BurnsDaughter: Doreena BurnsFather-in-Law: Otto GraycombMother-in-Law: Lolly DuBoisDaughter-in-Law: Daphne BurnsGrandchildren: Charles Montgomery Burns, George Burns, Cornelius Burns, Zeph Burns, Cornelia Hernandez and 10 unnamedGreat-Grandson: Larry BurnsGreat-Granddaughter-in-Law: UnnamedGreat-Great-Grandchildren: UnnamedSecond cousin: \"Old Tut\" Simpson",
    "first_appearance": "\"Last Exit to Springfield\"",
    "voiced_by": "Harry Shearer",
    "name": "Wainwright Montgomery Burns"
  },
  {
    "sex": "Male",
    "status": "Deceased",
    "hair": "White",
    "relatives": "Parents: Clifford Burns and Daphne BurnsSiblings: Charles Montgomery Burns, George Burns, Cornelius Burns, Cornelia Hernandez and 10 other unnamed childrenGrandfather: Wainwright Montgomery BurnsGrandmother: Evelyn GraycombGreat-Grandfathers: Franklin Jefferson Burns and Otto GraycombGreat-Grandmother: Lolly DuBoisNephew: Larry BurnsNiece-in-Law: UnnamedGreat-Nephews/Nieces: Unnamed",
    "first_appearance": "The Simpsons Uncensored Family Album",
    "name": "Zeph Burns"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "hair": "Blonde",
    "relatives": "Mother: Mimsy Bancroft  Son: Larry Burns Daughter-In-Law: Unnamed Grandchildren: Several unnamed",
    "first_appearance": "\"Burns, Baby Burns\"",
    "first_mentioned": "\"Burns, Baby Burns\"",
    "name": "Lily Bancroft"
  },
  {
    "sex": "Female",
    "status": "Unknown",
    "hair": "Gray",
    "relatives": "Ex-boyfriend: Charles Montgomery Burns  Daughter: Lily Bancroft  Grandson: Larry Burns  Great-Grandchildren: Several unnamed",
    "first_appearance": "\"Burns, Baby Burns\"",
    "name": "Mimsy Bancroft"
  },
  {
    "sex": "Female",
    "status": "Deceased",
    "hair": "Present: Bald, wearing a black wig  Past: Black",
    "occupation": "Buddhist  Worked at a food stand years ago",
    "relatives": "Mother: Doreena BurnsUncle: Clifford BurnsMarital aunt: Daphne BurnsCousins: Charles Montgomery Burns, Cornelius Burns, George Burns, Cornelia Burns, Zeph Burns and 10 unnamedFirst cousins once removed: Pepita Hernandez and Larry Burns",
    "first_appearance": "\"Four Regrettings and a Funeral\"",
    "voiced_by": "Tress MacNeille",
    "name": "Lyla"
  }
]
